{
    "P_DIM_V.UPS_DIM_BOCA_POZO": {
        "description_long": "Esta tabla contiene metadatos detallados sobre pozos, y es relevante para consultas que buscan información sobre eventos u operaciones diarias relacionadas con los pozos presentes en esta tabla. Esta tabla es fundamental para aquellas consultas que requieran información detallada o filtrado de pozos en un contexto geoespacial y operativo porque dispone de metadatos de pozos relacionados a país, provincia, departamento, cuenca, yacimiento, área de concesión, operador, compañía, tipo de pozo, tipo de plataforma, coordenadas geográficas, inicio y fin de perforación, inicio y fin de terminación e inicio y fin de abandono de pozo, entre otros. Las columnas de relevancia de esta tabla hacen referencia al número de API, nombre de módulo, tipo de boca de pozo, id de pozo, nombre oficial de pozo, nombre corto de pozo, id de site, nombre de locación, id de policy, compañía OW, id y nombre de yacimiento, nombre de cuenca, número de pozo, id y nombre de área de concesión, tipo de área de concesión, id y nombre de operador inicial, id y nombre de ubicación, nombres de activo DBU, subregión, región y jerarquía, nombre de zona, nombre de módulo, fecha propuesta de pozo, nivel de referencia de profundidad, sistema de coordenadas y diversas coordenadas geográficas asociadas al pozo, jurisdicción, id y nombre de país, id y nombre de provincia, id y nombre de departamento, profundidades programadas (no es la medida actual del pozo sino la planificada) TVD y TMD, operador actual, fechas de inicio y fin de operación, terminación y abandono, tipo y nombre de plataforma, profundidad de agua, fecha de inicio de producción, entre otras. Si el usuario pregunta por 'Cuántos pozos se perforaron durante <fecha aleatoria> en el área <nombre del área>, entonces incluye esta tabla en la selección. SIEMPRE que la pregunta incluya el nombre (Boca_Pozo_Nombre_Oficial) o alguna identificación del pozo, debes incluir esta tabla para poder conseguir su Well_Id.",
        "description_short": "Esta tabla contiene metadatos detallados sobre pozos y es relevante para consultas que buscan información sobre eventos u operaciones diarias relacionadas con los pozos en un contexto geoespacial y operativo porque dispone de metadatos de pozos relacionados a país, provincia, departamento, cuenca, yacimiento, área de concesión, operador, compañía, tipo de pozo, tipo de plataforma, coordenadas geográficas, inicio y fin de perforación, inicio y fin de terminación e inicio y fin de abandono de pozo, entre otros.",
        "columns": {
            "Pozo_Num": "Número del pozo",
            "API_Nro": "Número de API",
            "Modulo_Name": "Nombre de módulo",
            "Tipo_Boca_Pozo_Desc": "Tipo de boca de pozo descripción",
            "Well_Id": "Id de pozo. Suele ser un número en string de tipo 'yq2d3dh'. NO es el nombre del pozo sino su identificación. Si esta columna es seleccionada, tambien deberas seleccionar 'Boca_Pozo_Nombre_Oficial' Sirve para conectar con otras tablas a partir del nombre de pozo. Es Foreign key. ",
            "Boca_Pozo_Nombre_Oficial": "Nombre completo del pozo. Utilizado típicamente cuando se refieren al 'el pozo', salvo que se indique específicamente un número, ejemplo 'el pozo 2490'. Dato ejemplo: 'YPF.Ch.LC-865'. Tipo de dato: str. Consejo: utiliza `LIKE` wildcard, '%' y '_' para búsquedas en esta columna e incluye LOWER(<column_name>) LIKE LOWER('%<column_value>%').",
            "Boca_Pozo_Nombre_Corto_Oficial": "Nombre corto o abreviado del pozo.",
            "Site_Id": "Id de sitio",
            "Locacion_Name": "Nombre de locación",
            "Policy_Id": "Id de policy",
            "Compania_OW_Name": "Nombre de OW de compañía",
            "Yacimiento_Id": "Id de yacimiento",
            "Cuenca_Name": "Nombre de cuenca",
            "Yacimiento": "Identificador de yacimientos. Consejo: utiliza `LIKE` wildcard, '%' y '_' para búsquedas en esta columna e incluye LOWER(<column_name>) LIKE LOWER('%<column_value>%').",
            "Bis_Ind": "Indicador Bis",
            "Area_Concesion_Id": "Id de áreas de concesión. El dato es un código numérico. Ejemplo: '312'. No es el nombre del área y el usuario no suele referirse con esta columna.",
            "Tipo_Area_Concesion_Cd": "Tipos de áreas de concesión",
            "Operador_Inicial_Pozo_Id": "Id de operador inicial de pozos",
            "Operador_Inicial_Pozo_Name": "Nombre de operador inicial de pozos",
            "Tipo_Ubicacion_Id": "Id de tipo de ubicación",
            "Tipo_Ubicacion_Name": "Nombre de tipo de ubicación",
            "Activo_Dbu_Name": "Nombre de DBU activo",
            "Subregion_Dbu_Name": "Nombre de subregión DBU",
            "Regional_Dbu_Name": "Nombre de región DBU",
            "Jerarquia_Dbu_Name": "Nombre de jerarquía DBU",
            "Tipo_Jerarquia_Dbu_Cd": "Tipo de jerarquía DBU",
            "Zona_Tow_Name": "Nombre de zona tow",
            "Modulo_Tow_Name": "Nombre de módulo tow",
            "Fecha_Propuesta_Pozo_Dt": "Fecha propuesta de pozo dt",
            "Nivel_Referencia_Profundidad_Desc": "Nivel de referencia de profundidad descendiente",
            "Tipo_Referencia_Coord_Proy_Temp_Cd": "Tipo de referencia coordenada proyectada temp cd",
            "Coordenada_Proyectada_Temp_X_Meas": "Coordenada proyectada temp eje x",
            "Coordenada_Proyectada_Temp_Y_Meas": "Coordenada proyectada temp eje y",
            "Sistema_Coord_Geografica_Referencia_Temp_Name": "Nombre de referencia de sistema de coordenada geográfica temp",
            "Tipo_Referencia_Coord_Geografica_Temp_Cd": "Tipo de referencia de coordenada geográfica temp",
            "Coordenada_Geografica_Temp_Latitud_Meas": "Coordenada geográfica temp latitud meas",
            "Coordenada_Geografica_Temp_Longitud_Meas": "Coordenada geográfica temp longitud meas",
            "Sistema_Coord_Proyectada_Name": "Nombre de sistema de coordenada proyectada",
            "Tipo_Referencia_Coord_Proy_Cd": "Tipo de referencia de coordenada proyectada cd",
            "Coordenada_Proyectada_X_Meas": "Coordenada proyectada eje x meas",
            "Coordenada_Proyectada_Y_Meas": "Coordenada proyectada eje y meas",
            "Sistema_Coord_Posgard_Name": "Nombre de sistema de coordenadas posgard",
            "Tipo_Referencia_Coord_Posgard_Cd": "Tipo de referencia de coordenadas posgard cd",
            "Coordenada_Posgard_X_Meas": "Coordenada eje x posgard",
            "Coordenada_Posgard_Y_Meas": "Coordenada eje y posgard",
            "Sistema_Coord_Inchauspe_Id": "Id de sistema de coordenadas inchauspe",
            "Sistema_Coord_Inchauspe_Name": "Nombre de sistema de coordenadas inchauspe",
            "Tipo_Referencia_Coord_Inchauspe_Cd": "Tipo de referencia de coordenadas inchauspe cd",
            "Coordenada_Inchauspe_X_Meas": "Coordenadas inchauspe eje x meas",
            "Coordenada_Inchauspe_Y_Meas": "Coordenadas inchauspe eje y meas",
            "Sistema_Coord_Geografica_Referencia_Name": "Nombre de referencia de sistema de coordenadas geográficas",
            "Tipo_Referencia_Coord_Geografica_Cd": "Tipo de referencia de coordenadas geográficas cd",
            "Coordenada_Geografica_Latitud_Meas": "Coordenada geográfica latitud meas",
            "Coordenada_Geografica_Longitud_Meas": "Coordenada geográfica longitud meas",
            "Fuente_Dato_Txt": "Fuentes de datos",
            "Cota_Num": "Número de cota",
            "Offshore_Ind": "Indicador de offshore",
            "Jurisdiccion_Nacional_Ind": "Indicador de jurisdicción nacional",
            "Pais_Id": "Id de país",
            "Pais_Name": "Nombre de país",
            "Provincia_Id": "Id de provincia",
            "Provincia_Short_Name": "Nombre corto o abreviado de provincia",
            "Provincia_Name": "Nombre de provincia",
            "Departamento_Id": "Id de departamento",
            "Departamento_Short_Name": "Nombre corto de departamento",
            "Departamento_Name": "Nombre de departamento",
            "Profundidad_Programada_Tvd_Num": "NO UTILIZAR, salvo que se pida la profundad PROGRAMADA. Profundidad número TVD (true vertical depth), es la profundidad vertical programada o planificada, no es la profundidad actual del pozo sino su objetivo final.",
            "Profundidad_Programada_Tmd_Num": "NO UTILIZAR, salvo que se pida la profundad PROGRAMADA. Profundidad número TMD (true measured depth), es la profundidad medida programada o planificada, no es la profundidad actual del pozo sino su objetivo final.",
            "Area_Reserva_Id": "Id de área de reserva",
            "Area_Reserva_Name": "Nombre de área de reserva",
            "Operador_Actual_Pozo_Short_Name": "Nombre corto de operador actual de pozo",
            "Operador_Actual_Pozo_Name": "Nombre de operador actual de pozo",
            "Pertenece_YPF_Ind": "Indicador de pertenencia a YPF",
            "Linea_Sismica_Name": "Nombre de línea sísmica",
            "Estaca_Num": "Número de estaca",
            "Cruce_Lineas_Name": "Nombre de cruce de líneas",
            "Kop_Desc": "Descripción de KOP",
            "Blank_Pipe_Desc": "Descripción de blank pipe",
            "Excluder_Screen_Desc": "Descripción de excluder screen",
            "Comentarios_Txt": "Comentarios",
            "Fecha_Inicio_Perforacion_Pozo_Original_Dttm": "Fecha de inicio de perforación de pozo original",
            "Fecha_Fin_Perforacion_Pozo_Original_Dttm": "Fecha de finalización de perforación de pozo original",
            "Fecha_Inicio_Terminacion_Dttm": "Fecha de inicio de terminación DTTM",
            "Fecha_Fin_Terminacion_Dttm": "Fecha de finalización de terminación DTTM",
            "Estado_Inicial_Pozo_Cd": "Código de estado inicial de pozo",
            "Fecha_Inicio_Abandono_Superficie_Dttm": "Fecha de inicio de abandono de superficie DTTM",
            "Fecha_Fin_Abandono_Superficie_Dttm": "Fecha de fin de abandono de superficie DTTM",
            "Nombre_Plataforma_Cd": "Código de nombre de plataforma",
            "Tipo_Plataforma_Cd": "Código de tipo de plataforma",
            "Profundidad_Agua_Num": "Número de profundidad de agua",
            "Pozo_Descubridor_Ind": "Indicador de pozo descubridor",
            "Profundidad_Perfil_Num": "Número de profundidad de perfil",
            "Coordenada_X_Fondo_Num": "Número de coordenada X fondo",
            "Coordenada_Y_Fondo_Num": "Número de coordenada Y fondo",
            "Multipad_Ind": "Indicador de multipad",
            "Pad_Id": "Id de pad",
            "Fecha_Inicio_Prod_SEN_Dt": "Fecha de inicio de producción SEN",
            "Sistema_Coord_Proyectada_Referencia_Id": "Id de referencia de sistema de coordenada proyectada",
            "Sistema_Coord_Geografica_Referencia_Id": "Id de referencia de sistema de coordenada geográfica"
        }
    },
    "P_DIM_V.UPS_FT_DLY_OPERACIONES": {
        "description_long": "Esta tabla contiene datos detallados actuales e históricos sobre las operaciones diarias en los pozos. Los datos están principalmente relacionados con las tareas diarias de operación y la profundidad medida en la que se dio la misma. Esta tabla es útil cuando se solicita información actual del pozo, es decir, datos en tiempo real. Es importante para consultas que buscan información específica sobre las actividades y operaciones diarias en cada pozo. Es una de las tablas más importantes porque dispone de información relacionada a las operaciones diarias, informando IDs y códigos de fallas, actividades, operaciones, suboperaciones y actividades, datos específicos de las fallas presentadas como horas de falla, costo asociado a la falla, descripción de fallas, sistemas y subsistemas de fallas, primeras y últimas actividades diarias. Las columnas relevantes de esta tabla hacen referencia al ID de pozo, ID de evento, ID de wellbore, ID de parte diario (DAILY_ID), ID de actividad, ID de reporte, ID de falla, ID de equipo, fecha, fecha desde, fecha hasta, registro de horas, valor de programa PTO, ID de programa PTO, clase de actividad, clase de tiempo, código de fase, código y descripción de actividad, código y descripción de operación, código y descripción de suboperación, compañía txt, unidades en QTY, profundidad desde (MD_DESDE) y profundidad hasta (MD_HASTA), profundidad en metros, tarifa, código de evento, costo de falla en el día, costo total bruto de falla, falla desde y hasta, total de horas de falla, profundidad de falla, otros costos de falla, ID de falla, locación de falla, equipo propietario y compañía, descripción de falla en sistema y subsistema, costo del equipo, servicio, detenciones de equipo NPT (NPT es habitualmente consultado por usuarios), IDs de causa, ubicación y consecuencia de NPT, costo de NPT del contratista, NPT productivo, NPT neto, costo neto de NPT total, ID del grupo y causa de NPT, ID de primera y últimas actividades generales y diarias, tipo de inspección, NPT anidado, título y descripción de falla, tipo de evento no planificado, número de alerta, ID de SIGEO, detalle de maniobras, estado, códigos alternativos de actividad, fechas de creación, actualización y transmisión. Adicionalmente, se relaciona con otras tablas usando exclusivamente las columnas que terminan en '_COD'. Esta tabla es útil cuando se solicita información actual de un pozo. Aclaración: Los usuarios suelen hacer referencia a fallas con palabras como pérdidas, problemas, inconvenientes o similares.",
        "description_short": "Esta tabla contiene datos detallados sobre las operaciones diarias en los pozos. Los datos están principalmente relacionados con las tareas diarias de operación. Es importante para consultas que buscan información específica sobre las actividades y operaciones diarias en cada pozo. Es una de las tablas más importantes porque dispone de información relacionada a las operaciones diarias, informando IDs y códigos de fallas, actividades, operaciones y suboperaciones, datos específicos de las fallas presentadas como horas de falla, costo asociado a la falla, descripción de fallas, sistemas y subsistemas de fallas, primeras y últimas actividades diarias. Además, contiene causas, consecuencias, ubicación y costos de paradas de equipo NPT (NPT es habitualmente consultado por usuarios), número de reporte, fechas pertinentes, entre otros. Aclaración: Los usuarios suelen hacer referencia a fallas con palabras como pérdidas, problemas, inconvenientes y similares.",
        "columns": {
            "REPORT_JOURNAL_ID": "ID del diario de reporte.",
            "FECHA": "Fecha de la operación registrada.",
            "DESDE": "Hora de inicio de la operación.",
            "HASTA": "Hora de fin de la operación.",
            "PTO_PROGRAMA": "Punto en el programa de operaciones.",
            "PTO_PROGRAMA_ID": "ID asociado al punto en el programa.",
            "CLASE_ACTIVIDAD": "Clase de la actividad realizada.",
            "FASE_COD": "Código alfanumérico de la fase. A continuación, te daré los códigos de las fases más usuales:\n- 00: PREPARACIÓN DE LOCACIÓN\n- 01: DTM\n- 03: REVESTIMIENTO GUÍA\n- 04: REVESTIMIENTO DE SEGURIDAD\n- 05: REVESTIMIENTO INTERMEDIA 1\n- 06: REVESTIMIENTO INTERMEDIA 2\n- 07: REVESTIMIENTO INTERMEDIA 3\n- 08: REVESTIMIENTO DE AISLACIÓN\n- 0P: PLANTA LODO\n- 0S: STANDBY\n- 10a: CONTACTA/INTERVIENE FORMACIÓN\n- 10b: BAJAR INSTALACIÓN\n- 11a: SACAR INSTALACIÓN\n- 11b: ACONDICIONA/REPARA POZO\n- 12: TAPONAMIENTO Y ABANDONO",
            "ACTIVIDAD_COD": "Código que identifica la actividad específica.",
            "ACTIVIDAD_DESC": "Descripción de la actividad realizada.",
            "OPERACION_COD": "Código que identifica la operación.",
            "SUBOPERACION_COD": "Código que identifica la suboperación dentro de la actividad.",
            "SUBOPERACION_DESC": "Descripción de la suboperación.",
            "COMPANIA_TXT": "Nombre de la compañía que lleva a cabo la operación.",
            "UNIDADES_QTY": "Cantidad de unidades usadas o afectadas durante la operación.",
            "MD_DESDE": "UTILIZAR SIEMPRE QUE SE SOLICITE 'PROFUNDIDAD'. Profundidad medida desde donde inicia la operación.",
            "MD_HASTA": "UTILIZAR SIEMPRE QUE SE SOLICITE 'PROFUNDIDAD'.Profundidad medida hasta donde finaliza la operación.",
            "MD_METROS": "Cantidad total de metros operados en la actividad.",
            "TARIFA": "Tarifa aplicada a la operación.",
            "EVENTO_COD": "Código del evento asociado a la operación.",
            "PROFUNDIDAD_VERTICAL": "Medición de la profundidad vertical en el pozo durante la operación.",
            "FALLA_TOTAL_COSTO_BRUTO": "Costo bruto total de cualquier falla ocurrida.",
            "FALLA_HASTA": "Tiempo hasta el que se extiende el impacto de la falla.",
            "FALLA_DESDE": "Inicio del impacto de la falla.",
            "FALLA_TOTAL_HORAS": "Total de horas afectadas por la falla. No se consideran NPT.",
            "FALLA_CERRADA": "Indicador si la falla ha sido cerrada y resuelta.",
            "FALLA_OTRO_COSTO": "Otros costos asociados a la falla.",
            "FALLA_LOCACION": "Localización de la falla.",
            "EQUIPO_PROPIETARIO": "Propietario del equipo implicado en la operación.",
            "FALLA_TIPO_ID": "Identificador del tipo de falla.",
            "COMPANIA": "Compañía responsable o implicada en la operación.",
            "FALLA_SISTEMA_DESC": "Descripción del sistema donde ocurrió la falla.",
            "FALLA_SUBSISTEMA_DESC": "Descripción del subsistema afectado por la falla.",
            "EQUIPO_COSTO": "Costo asociado al equipo usado en la operación.",
            "SERVICIO": "Servicio proporcionado o afectado durante la operación.",
            "NPT_CAUSA_RAIZ_ID": "Identificador de la causa raíz del tiempo no productivo (NPT).",
            "NPT_UBICACION_ID": "Identificador de la ubicación relacionada con el NPT.",
            "NPT_CONSECUENCIA_DESC": "Descripción de las consecuencias del NPT.",
            "NPT_COSTO_CONTRATISTA": "Costos incurridos por el contratista debido al NPT.",
            "NPT_PRODUCTIVO": "Indicador si el tiempo no productivo fue productivo en algún sentido.",
            "NPT_COSTO_NETO_TOTAL": "Costo total neto asociado al tiempo no productivo.",
            "NPT_GRUPO_ID": "Grupo asociado al NPT.",
            "NPT_CAUSA_ID": "Identificador de la causa del NPT.",
            "FIRST_ACTIVITY_DAILY_ID": "Identificador de la primera actividad del día.",
            "FIRST_ACTIVITY_ID": "Identificador de la primera actividad.",
            "LAST_ACTIVITY_DAILY_ID": "Identificador de la última actividad del día.",
            "LAST_ACTIVITY_ID": "Identificador de la última actividad.",
            "TIPO_INSPECCION": "Tipo de inspección realizada durante la operación.",
            "NPT_ANIDADO": "Indicador si el NPT está anidado dentro de otra categoría.",
            "ES_READONLY": "Indica si el registro es de solo lectura.",
            "FALLA_TITULO": "Título descriptivo de la falla.",
            "FALLA_DESC": "Descripción detallada de la falla.",
            "COD_TIPO_NPT": "Código que identifica el tipo de NPT.",
            "TIPO_EVENTO_NO_PLANIFICADO": "Tipo de evento no planificado que se registró.",
            "NPT_UBICACION_DESC": "Descripción de la ubicación del NPT.",
            "DOBLE_BARRERA": "Indica si se utilizó una doble barrera de seguridad en la operación.",
            "ID_SIGEO": "Identificador en el sistema SIGEO.",
            "REPORT_NO": "Número de reporte asociado a la operación.",
            "ESTADO": "Estado actual del registro de la operación.",
            "ACTIVITY_ALT_CODE1": "Código alternativo de la actividad 1.",
            "ACTIVITY_ALT_CODE2": "Código alternativo de la actividad 2.",
            "ACTIVITY_ALT_CODE3": "Código alternativo de la actividad 3.",
            "DETALLE_MANIOBRAS_TXT": "Texto descriptivo de las maniobras realizadas.",
            "FECHA_CREACION": "Fecha de creación del registro.",
            "FECHA_ACTUALIZACION": "Fecha de última actualización del registro.",
            "FECHA_TRANSMISION": "Fecha en que se transmitió el reporte.",
            "NPT_GRUPO": "Grupo asociado al NPT.",
            "FALLA_COSTO_DIA": "Costo diario de la falla.",
            "CLASE_TIEMPO": "Clasificación del tiempo durante la operación.",
            "EQUIPO_ID": "Identificador del equipo utilizado. El usuario no conoce este valor, para utilizarlo deberás buscar el nombre del Equipo en otra tabla y hacer join con esta columna. Foreign Key.",
            "DAILY_ID": "Identificador diario asociado a la operación.",
            "EVENT_ID": "Identificador del evento específico. Es Foreign key.",
            "WELL_ID": "Identificador del pozo asociado a la operación.",
            "NO_ALERTA_CMASS": "Indicador de alerta en el sistema CMASS.",
            "FALLA_PROF": "Profundidad a la que se produjo la falla.",
            "OPERACION_DESC": "Descripción de la operación realizada.",
            "HORAS": "Cantidad de horas que duró la operación.",
            "FAILURE_ID": "Identificador de la falla.",
            "ACTIVITY_ID": "Identificador de la actividad realizada.",
            "WELLBORE_ID": "Identificador del wellbore asociado a la operación."
        }
    },
    "P_DIM_V.UPS_DIM_EVENTO": {
        "description_long": "Esta tabla contiene información detallada sobre eventos relacionados con los pozos, incluyendo descripciones de eventos, locaciones, objetivos, y supervisión operativa. Presenta datos relevantes como compañía operadora, costos asociados, tipo de equipo, presiones, fechas de inicio y fin del evento, así como el estado final del evento. Además, incluye detalles específicos como la elevación datum, política asociada y datos sobre el cumplimiento de los objetivos iniciales. Las columnas relevantes hacen referencia al número de API, ID de evento, descripción del evento, tipo de equipo, estado final del evento, código y número de evento, locación, objetivo inicial y si fue cumplido, ID de policy, ID del sitio, ID del pozo, nombre oficial del pozo y yacimiento, entre otros.",
        "description_short": "Esta tabla contiene información detallada sobre eventos relacionados con los pozos. Es relevante para consultas que requieran información específica sobre eventos, incluyendo datos de la compañía, costo, descripción del evento, tipo de equipo, estado, código y número de evento, locación, objetivo inicial y si fue cumplido, ID de policy, ID del sitio, yacimiento, fechas de inicio y fin de eventos de perforación.",
        "columns": {
            "DESCRIPCION_EVENTO": "Descripción detallada del evento.",
            "EVENT_CODE": "Código alfanumérico que identifica el tipo de evento en el ámbito de oil & gas. Este código se utiliza para clasificar y consultar eventos específicos de manera concisa en el sistema. Los posibles eventos y sus respectivas siglas son los siguientes:\n- INW: Intervención Workover\n- REP: Reparación\n- PER: Perforación\n- STB: Stand by\n- INT: Intervención pulling\n- ABA: Abandono\n- PTL: Planta de lodos\n- ISW: Evento indefinido o en espera de especificar\n- TER: Terminación\n- RPE: re entry o reingreso\n- PRF: Pre factura\nEste código permite que los usuarios, cuando hacen consultas SQL a partir de texto, puedan referirse a eventos de manera directa, por ejemplo, 'equipos en pulling' quiere decir 'equipos en el evento de pulling EVENT_CODE INT'.",
            "EVENT_NO": "Número secuencial asignado al evento.",
            "FECHA_FIN": "Fecha en que concluyó el evento.",
            "LOCACION": "Ubicación geográfica donde ocurrió el evento.",
            "OBJETIVO_CUMPLIDO": "Indica si los objetivos del evento fueron alcanzados.",
            "OBJETIVO_INICIAL": "Objetivos planteados al inicio del evento.",
            "SITE_ID": "Identificador del sitio donde se llevó a cabo el evento.",
            "WELL_ID": "Identificador del pozo asociado al evento.",
            "Boca_Pozo_Nombre_Oficial": "Nombre oficial del pozo donde ocurrió el evento.",
            "YACIMIENTO": "Nombre del yacimiento donde se encuentra el pozo.",
            "PRESION_TBG": "Presión registrada en la tubería de producción durante el evento.",
            "ORIGEN": "Origen del reporte o del dato del evento.",
            "SUPERVISOR_OPERATIVO": "Nombre del supervisor a cargo durante el evento.",
            "TIEMPO_IAP": "Tiempo de parada o inactividad asociado al evento.",
            "SECTOR_RESP_EVENTO": "Sector responsable de responder o manejar el evento.",
            "POLICY_ID": "Identificador de la política bajo la cual se registra el evento.",
            "ESTADO_FIN": "Estado final del evento (ej: completado, cancelado, en progreso).",
            "COMPAÑIA": "Compañía que opera o es responsable del evento.",
            "API_Nro": "Número de API asociado al pozo en el evento.",
            "EVENT_ID": "Identificador único del evento. Es Foreign key.",
            "PRESION_CSG": "Presión en el casing o revestimiento durante el evento.",
            "FECHA_INICIO": "Fecha de inicio del evento.",
            "EQUIP_TYPE": "Tipo de equipo utilizado en el evento.",
            "COSTO_OBJETIVO": "Costo proyectado o presupuestado para alcanzar los objetivos del evento.",
            "DATUM_ELEVATION": "Elevación del datum de referencia para las mediciones del pozo."
        }
    },
    "P_DIM_V.UPS_DIM_EQUIPO": {
        "description_long": "Esta tabla contiene información detallada sobre todos los equipos que tuvieron actividad en YPF a lo largo del tiempo, ya sean Perforas, Workovers, pulling o MASES. Es una tabla que incluye todos los equipos en existencia en YPF, estén actualmente activos o no. Es relevante cuando se busca información relacionada con el nombre del equipo, nombre de contratista, tipo de equipo, clase de equipo, potencia, etc. Entre la información disponible en sus columnas se encuentra el ID de equipo, nombre de equipo, ID de contratista, nombre de contratista, tipo de equipo, clase de equipo, potencia del equipo y número del equipo (RIG). Los pozos y los equipos son entidades separadas que pueden o no estar relacionadas. Los equipos son herramientas utilizadas en diferentes pozos durante distintas etapas de operación. Un pozo puede tener varios equipos asignados que realizan tareas en él, pero los equipos siempre están asignados a un solo pozo en un momento determinado. Los equipos son utilizados en múltiples pozos a lo largo de su vida útil, por lo que esta interrelación entre pozos y equipos debe ser considerada y tomada en cuenta para no confundir pozos con equipos y viceversa.",
        "description_short": "Esta tabla contiene información detallada sobre todos los equipos que tuvieron actividad en YPF a lo largo del tiempo, ya sean Perforas, Workovers, pulling o MASES. Incluye equipos activos e inactivos.",
        "columns": {
            "EQUIPO_ID": "Identificador del equipo utilizado. El usuario no conoce este valor, para utilizarlo deberás buscar el nombre del Equipo en otra tabla y hacer join con esta columna. Foreign Key.",
            "NOMBRE_EQUIPO": "Nombre del equipo. No es foreign key. Consejo: utiliza `LIKE` wildcard, '%' y '_' para búsquedas en esta columna.",
            "ID_CONTRACTOR": "ID de la contratista.",
            "CONTRATISTA": "Nombre de la contratista. Compañía de servicio a la que pertenece el equipo.",
            "TIPO_EQUIPO": "Hace referencia a su principio de funcionamiento. Puede tomar valores como mecánico, hidráulico, empty, otros, S/D. Consejo: utiliza `LIKE` wildcard, '%' y '_' para búsquedas en esta columna.",
            "CLASE_EQUIPO": "Hace referencia a la clase de tarea que desarrolla. Se debe utilizar siempre que se indique un tipo de actividad específica como 'equipos en pulling'. Puede tomar valores como: 'Equipo de RTP', 'MASE', 'Equipo de Cable', 'Equipo Abandono', 'Equipo Perforador', 'Equipo Coiled Tubing', 'Equipo de Pulling', 'UAF / USE', 'Equipo de Alambre', 'Unidad Cementadora', 'Equipo Superficie', 'Equipo Otros', 'Equipo Flush By'. Consejo: utiliza `LIKE` wildcard, '%' y '_' para búsquedas en esta columna.",
            "POTENCIA": "Potencia del equipo.",
            "RIG_NO": "Número de equipo. Concatenado junto con el nombre de la contratista se arma el nombre del equipo. Ejemplo: PLUSPETROL 02."
        }
    },
    "P_DIM_V.UPS_DIM_EQUIPOS_ACTIVOS": {
        "description_long": "Esta tabla contiene información detallada sobre todos los equipos que están actualmente activos o en actividad, sean de perforación, workover, MASES o pulling. Todos los registros presentes en esta tabla hacen referencia a equipos activos independientemente de que en ciertas columnas se informe tiempos de fin de actividad. Cada equipo desarrolla diversas actividades con fecha de inicio y fin, pero siempre será un equipo activo si se encuentra en esta tabla. Esta tabla no tiene una columna que indique el estado 'activo' o 'inactivo' del pozo. La mera existencia del ID de equipo en esta tabla ya asegura que es un equipo efectivamente activo. Entre la información presente en las columnas de esta tabla se encuentra la unidad de negocio, ID de pozo asociado al equipo, ID de operador, ID de actividad, ID de equipo, región de negocio, número de evento, yacimiento, nombre legal del pozo asociado al equipo, código de evento, fecha de inicio de evento, contratista, clase de equipo, operador, supervisores, resumen de últimas 24 horas y resumen de forecast de próximas actividades, lease type, código de fase actual, ingeniero a cargo y planificador del equipo. Los pozos y los equipos son entidades separadas que pueden o no estar relacionadas. Los equipos son herramientas utilizadas en diferentes pozos durante distintas etapas de operación. Un pozo puede tener varios equipos asignados que realizan tareas en él, pero los equipos siempre están asignados a un solo pozo en un momento determinado. Los equipos son utilizados en múltiples pozos a lo largo de su vida útil, por lo que esta interrelación entre pozos y equipos debe ser considerada y tomada en cuenta para no confundir pozos con equipo y viceversa.",
        "description_short": "Esta tabla contiene información detallada sobre todos los equipos que están actualmente activos o en actividad, sean de perforación, workover, MASES, pulling y otros. Todos los registros presentes en esta tabla hacen referencia a equipos activos independientemente de que en ciertas columnas se informe fecha de fin de actividad. Cada equipo desarrolla diversas actividades con fecha de inicio y fin, pero siempre será un equipo activo si se encuentra en esta tabla. SIEMPRE que se consulte sobre equipos activos en perforación deberá utilizarse esta tabla.",
        "columns": {
            "FASE_COD": "Código alfanumérico de la fase. A continuación, te daré los códigos de las fases más usuales:\n- 00: PREPARACIÓN DE LOCACIÓN\n- 01: DTM\n- 03: REVESTIMIENTO GUÍA\n- 04: REVESTIMIENTO DE SEGURIDAD\n- 05: REVESTIMIENTO INTERMEDIA 1\n- 06: REVESTIMIENTO INTERMEDIA 2\n- 07: REVESTIMIENTO INTERMEDIA 3\n- 08: REVESTIMIENTO DE AISLACIÓN\n- 0P: PLANTA LODO\n- 0S: STANDBY\n- 10a: CONTACTA/INTERVIENE FORMACIÓN\n- 10b: BAJAR INSTALACIÓN\n- 11a: SACAR INSTALACIÓN\n- 11b: ACONDICIONA/REPARA POZO\n- 12: TAPONAMIENTO Y ABANDONO",
            "Afe_No": "Número AFE (Authorization for Expenditure) asociado al equipo.",
            "Barrera_1": "Primera barrera de seguridad asociada al equipo.",
            "Barrera_2": "Segunda barrera de seguridad asociada al equipo.",
            "Comment_Forecast_24_Anterior": "Resumen de las últimas 24 horas de actividades realizadas en el equipo y pozo.",
            "Compania": "Nombre de la empresa compañía del equipo activo actualmente.",
            "Suboperacion_Cod": "Código de la suboperación relacionada con el equipo.",
            "Cr3": "Código de CR3 (Control de Riesgos Críticos) asociado al equipo.",
            "Fecha_Inicio": "Fecha de inicio de la actividad del equipo.",
            "Detalle_Maniobra_Npt": "Detalle de maniobras del company man de las principales causas de NPT.",
            "Dias_Dtm": "Días dedicados al proyecto DTM (Drilling Time Management).",
            "Dias_Npt_Sin_Dtm": "Días de NPT sin incluir DTM.",
            "Dias_Proyectados": "Días proyectados de actividad para el equipo.",
            "Doble_Barrera": "Indicador de doble barrera de seguridad.",
            "Ingeniero": "Ingeniero o responsable a cargo del equipo.",
            "Tipo_Equipo": "Tipo de equipo según su principio de funcionamiento.",
            "Event_Code": "Código alfanumérico que identifica el tipo de evento en el ámbito de oil & gas. Este código se utiliza para clasificar y consultar eventos específicos de manera concisa en el sistema. Los posibles eventos y sus respectivas siglas son los siguientes:\n- INW: Intervención Workover\n- REP: Re entry perforación\n- PER: Perforación\n- STB: Stand by\n- INT: Intervención pulling\n- ABA: Abandono\n- PTL: Planta de lodos\n- ISW: Evento indefinido o en espera de especificar\n- TER: Terminación\n- PRF: Pre factura\nEste código permite que los usuarios, cuando hacen consultas SQL a partir de texto, puedan referirse a eventos de manera directa, por ejemplo, 'equipos en pulling' quiere decir 'equipos en el evento de pulling Event_Code INT'.",
            "Event_Id": "ID del evento relacionado con el equipo. Es Foreign key.",
            "Event_NO": "Número del evento relacionado con el equipo.",
            "Objetivo_Inicial": "Objetivo inicial del evento o actividad.",
            "Fecha_Ini_Dtm": "Fecha de inicio de la gestión DTM.",
            "Fecha_Prueba_Func_Bop": "Fecha de la prueba funcional del BOP (Blowout Preventer).",
            "Fecha_Ult_Ensayo_Bop": "Fecha del último ensayo del BOP.",
            "Yacimiento": "Yacimiento en donde se encuentra el pozo y el equipo en este momento.",
            "Lease_Type": "Tipo de arrendamiento asociado al equipo.",
            "Locacion_Name": "Nombre de la locación donde se encuentra el equipo.",
            "Max_Dayn": "Número máximo de días de actividad del equipo.",
            "Max_Step_No": "Número máximo de pasos realizados por el equipo.",
            "Npt_Ult_24_Hs": "NPT registrado en las últimas 24 horas.",
            "Operacion": "Operación en curso del equipo.",
            "Plan_Costo": "Costo planificado para la operación del equipo.",
            "Plan_Dias_Oper": "Días planificados para la operación del equipo.",
            "Planificador": "Planificador asignado al equipo.",
            "Provincia": "Provincia donde se encuentra el equipo.",
            "Real_Dias_Oper": "Días reales de operación del equipo.",
            "Rep_Journal_Oper": "ID del operador relacionado con el equipo.",
            "Rep_Journal_Plan": "ID del plan de operación del equipo.",
            "Resumen_24hs_Actual": "Resumen actual de las últimas 24 horas de actividad del equipo.",
            "Resumen_24hs_Anterior": "Resumen anterior de las últimas 24 horas de actividad del equipo.",
            "Equipo_Id": "Identificador del equipo utilizado. El usuario no conoce este valor, para utilizarlo deberás buscar el nombre del Equipo en otra tabla y hacer join con esta columna. Foreign Key.",
            "Nombre_Equipo": "Nombre del equipo.",
            "Rig_No": "Número de equipo.",
            "Rubro": "Rubro de explotación relacionado con el equipo.",
            "Sequenceno": "Número de secuencia del equipo.",
            "Boca_Pozo_Nombre_Corto_Oficial": "Nombre corto oficial del pozo asignado al equipo.",
            "Step_No": "Número de paso actual en la operación del equipo.",
            "Supervisor_Name_1": "Nombre del supervisor principal (Company Man) en el equipo.",
            "Supervisor_Name_2": "Nombre del supervisor secundario (Company Man) en el equipo.",
            "Telefono": "Número de teléfono asociado al equipo.",
            "Desde": "Fecha de inicio de la última actividad del equipo.",
            "Hasta": "Fecha de finalización de la última actividad del equipo.",
            "Ult_Daily": "ID del último reporte diario asociado al equipo.",
            "Ultimo_Dia_Actividad": "Último día de actividad del equipo.",
            "Ultima_Prof_Operativa": "Última profundidad operativa registrada en OpenWells y cargada en el sistema.",
            "Ultima_Prof_Planificada": "Última profundidad planificada registrada en OpenWells.",
            "Well_Id": "ID de pozo asociado al equipo.",
            "Boca_Pozo_Nombre_Oficial": "Nombre oficial del pozo asociado al equipo.",
            "Wellbore_Id": "ID del wellbore asociado al equipo.",
            "Telefono_Actual": "Teléfono actual del equipo.",
            "Descripcion_Evento": "Descripción del evento asociado al equipo.",
            "Costos_Proyectados": "Costos proyectados para la operación del equipo.",
            "Acumulado_Horas_Npt": "Horas acumuladas de NPT para el equipo.",
            "Activity_Id": "ID de actividad asociada al equipo.",
            "Actividad_Cod": "Código de actividad asociada al equipo.",
            "Act_Dur_Sin_Npt_Ult_Step": "Duración de la actividad sin NPT en el último paso.",
            "Regional_Dbu_Name": "Nombre de la región DBU asociada al equipo.",
            "Subregion_Dbu_Name": "Nombre de la subregión DBU asociada al equipo.",
            "Dias_Npt_Con_Dtm": "Días de NPT incluyendo DTM.",
            "Comment_Forecast_24_Actual": "Próximas actividades a realizar en el equipo y pozo en el día.",
            "Operacion_Cod": "Código de operación asociado al equipo.",
            "Detalle_Maniobras": "Detalle de maniobras realizadas por el equipo.",
            "Duracion_Actividad": "Duración de la actividad actual del equipo."
        }
    },
    "P_DIM_V.UPS_DIM_FASE_ACT_OPER_SUBOP_EVENT": {
        "description_long": "Esta tabla contiene información detallada sobre las fases, actividades, operaciones y suboperaciones asociadas con eventos específicos en los pozos. Es crucial para consultas que requieran un análisis exhaustivo de las fases de trabajo dentro de las operaciones de pozos, ya que proporciona datos como códigos y descripciones de eventos, fases, actividades, operaciones y suboperaciones. Especialmente útil para hacer joins con otras tablas de operaciones para obtener métricas específicas de las fases. Las columnas terminan en '_COD' para facilitar la relación con otras tablas mediante claves externas.",
        "description_short": "Esta tabla contiene información sobre las fases, actividades, operaciones y suboperaciones en eventos de pozos, relevante para consultas sobre detalles operacionales específicos. Aporta códigos y descripciones detalladas que son cruciales para la integración y análisis junto con otras tablas de datos de pozos.",
        "columns": {
            "ACTIVIDAD_DESC": "Descripción de la actividad realizada.",
            "COD_SUBOPERACION": "Código que identifica una suboperación específica dentro de una operación.",
            "SUBOPERACION": "Descripción detallada de la suboperación realizada.",
            "OPERACION": "Descripción general de la operación llevada a cabo.",
            "DESCRIPCION_EVENTO": "Descripción del evento asociado con la operación.",
            "EVENT_CODE": "Código alfanumérico que identifica el tipo de evento en el ámbito de oil & gas. Este código se utiliza para clasificar y consultar eventos específicos de manera concisa en el sistema. Los posibles eventos y sus respectivas siglas son los siguientes:\n- INW: Intervención Workover\n- REP: Re entry perforación\n- PER: Perforación\n- STB: Stand by\n- INT: Intervención pulling\n- ABA: Abandono\n- PTL: Planta de lodos\n- ISW: Evento indefinido o en espera de especificar\n- TER: Terminación\n- PRF: Pre factura\nEste código permite que los usuarios, cuando hacen consultas SQL a partir de texto, puedan referirse a eventos de manera directa, por ejemplo, 'equipos en pulling' quiere decir 'equipos en el evento de pulling EVENT_CODE INT'.",
            "FASE": "Descripción general de la fase operativa.",
            "COD_OPERACION": "Código que identifica la operación.",
            "ACTIVIDAD_COD": "Código alfanumérico que identifica la actividad.",
            "FASE_COD": "Código alfanumérico de la fase. A continuación, te daré los códigos de las fases más usuales:\n- 00: PREPARACIÓN DE LOCACIÓN\n- 01: DTM\n- 03: REVESTIMIENTO GUÍA\n- 04: REVESTIMIENTO DE SEGURIDAD\n- 05: REVESTIMIENTO INTERMEDIA 1\n- 06: REVESTIMIENTO INTERMEDIA 2\n- 07: REVESTIMIENTO INTERMEDIA 3\n- 08: REVESTIMIENTO DE AISLACIÓN\n- 0P: PLANTA LODO\n- 0S: STANDBY\n- 10a: CONTACTA/INTERVIENE FORMACIÓN\n- 10b: BAJAR INSTALACIÓN\n- 11a: SACAR INSTALACIÓN\n- 11b: ACONDICIONA/REPARA POZO\n- 12: TAPONAMIENTO Y ABANDONO"
        }
    },
    "P_DIM_V.UPS_FT_ARQUITECTURA_DETALLE_POZO": {
        "description_long": "Esta tabla contiene detalles específicos sobre casing, tubing y herramientas utilizadas en pozos, incluyendo información sobre profundidades, tipo de roscas, componentes y materiales asociados. Es fundamental para consultas que requieran una descripción detallada de la arquitectura del pozo y sus componentes, ya que presenta datos clave como diámetros, pesos, grados de acero, condiciones y capacidades de los componentes instalados en el pozo.",
        "description_short": "Tabla de detalle de casing, tubing y herramientas con datos de profundidades, tipo de roscas, y componentes utilizados en pozos.",
        "columns": {
            "Well_Id": "ID del pozo. Es una clave primaria utilizada para conectar esta tabla con otras tablas relacionadas con pozos.",
            "Wellbore_Id": "ID del wellbore asociado.",
            "Event_Id": "ID del evento relacionado. Es Foreign key.",
            "Assembly_Id": "ID del ensamblaje asociado.",
            "Section_Cd": "Código de la sección del pozo.",
            "Section_Name": "Nombre de la sección del pozo.",
            "Component_Cd": "Código del componente. Abreviatura del componente.",
            "Component_Code_Desc": "Descripción del código del componente según el sistema OW.",
            "Componente_Name": "Nombre específico del componente.",
            "Secuencia_Num": "Número de secuencia en la cual el componente es bajado al pozo.",
            "Detalle_Desc": "Descripción detallada del componente.",
            "Diametro_Txt": "Diámetro externo característico del componente.",
            "Cantidad_Piezas_Num": "Cantidad de piezas en la secuencia correspondiente.",
            "Longitud_Num": "Longitud acumulada para todos los componentes en la secuencia.",
            "Top_Set_Num": "Profundidad medida de la parte superior donde se instala el componente.",
            "Base_Set_Num": "Profundidad medida de la parte inferior donde se instala el componente.",
            "Peso_Num": "Peso del componente, generalmente en libras por pie (lbs/ft).",
            "Grado_Cd": "Grado del acero del componente.",
            "Rosca_Name": "Tipo de rosca del componente.",
            "Diametro_Nominal_Num": "Diámetro externo nominal del componente.",
            "Diametro_Interno_Num": "Diámetro interno del componente.",
            "Diametro_Externo_Maximo_Num": "Diámetro externo máximo del componente.",
            "Diametro_Interno_Minimo_Num": "Diámetro interno mínimo del componente.",
            "Material_Id": "ID del material del componente.",
            "Material_Item_Txt": "Descripción del material del componente.",
            "Material_Num_Txt": "Número del material del componente.",
            "Calibre_Num": "Calibre del componente, indicando el pasaje interno garantizado.",
            "Longitud_Ranura_Num": "Longitud de la ranura del componente.",
            "Diam_Nom_Conex_Sup_Num": "Diámetro de la conexión superior.",
            "Fabricante_Txt": "Nombre del fabricante del componente. ",
            "Condicion_Cd": "Condición del componente. Referencias: Nuevo, inspeccionado o reparado.",
            "Long_Conex_Sup_Num": "Longitud de la conexión superior.",
            "Modelo_Txt": "Modelo del componente.",
            "Tipo_Conex_Sup_Cd": "Código del tipo de conexión superior.",
            "Conf_Sup_Inic_Pín_Box_Cd": "Código de configuración inicial del pin o box de la conexión superior.",
            "Diam_Ext_Conex_Inf_Num": "Diámetro de la conexión inferior.",
            "Long_Conex_Inf_Num": "Longitud de la conexión inferior.",
            "Serie_Num": "Número de serie del componente.",
            "Sellador_Ind": "Indicador de si se ha aplicado sellador de rosca.",
            "Capacidad_Int_Num": "Capacidad interna del componente.",
            "Vol_Despl_Cerrado_Num": "Volumen desplazado por el componente cuando está cerrado.",
            "Torque_Num": "Torque de apriete aplicado al componente.",
            "Pres_Fluencia_Min_Num": "Presión de fluencia mínima del componente.",
            "Poissons_Ratio_Num": "Relación de Poisson del componente.",
            "Densidad_Tubing_Num": "Densidad del tubing del componente.",
            "Tarjeta_Linea_Colada_Txt": "Descripción de la tarjeta de línea de colada del componente."
        }
    },
    "P_DIM_V.UPS_FT_COMPONENTES": {
        "description_long": "Esta tabla contiene información detallada sobre los componentes utilizados en los pozos, incluyendo fechas de instalación, fresado, retiro y otros eventos relacionados. Es fundamental para consultas que requieren un seguimiento detallado del estado, ubicación, y características de los componentes instalados en un pozo a lo largo del tiempo. Esta tabla es crucial para gestionar la integridad y mantenimiento de los equipos subterráneos.",
        "description_short": "Tabla de componentes utilizados en los pozos con detalles sobre instalación, fresado, retiro, y características físicas de los componentes, facilitando un seguimiento detallado a lo largo del tiempo.",
        "columns": {
            "Fecha_Caido_Dt": "Fecha en la que el componente cayó al pozo, si aplica.",
            "Fecha_Retirado_Dt": "Fecha en la que el componente fue retirado del pozo.",
            "Estado_Actual_Cd": "Código que indica el estado actual del componente.",
            "Seccion_Tipo_Cd": "Código del tipo de sección donde está instalado el componente.",
            "Componente_Nombre_Cd": "Código que identifica el nombre del componente.",
            "Fecha_Dttm": "Fecha y hora de registro del estado actual del componente.",
            "Grupo_Componente_Cd": "Código que clasifica al componente dentro de un grupo específico.",
            "Cantidad_Piezas_Amt": "Cantidad de piezas del componente instaladas.",
            "Md_Top_Amt": "Profundidad medida al tope del componente.",
            "Md_Base_Amt": "Profundidad medida a la base del componente.",
            "Longitud_Amt": "Longitud del componente en metros.",
            "Diam_Int_Amt": "Diámetro interior del componente en pulgadas.",
            "Peso_Amt": "Peso del componente, generalmente en libras por pie.",
            "Rosca_Amt": "Tipo de rosca del componente.",
            "Calibre_Amt": "Calibre del componente en pulgadas.",
            "Torque_Amt": "Torque aplicado al componente en libras-pie.",
            "Diam_Nom_Conec_Sup_Amt": "Diámetro nominal de la conexión superior del componente.",
            "Longitud_Conec_Sup_Amt": "Longitud de la conexión superior del componente en pulgadas.",
            "Condicion_Cd": "Código que indica la condición del componente (nuevo, usado, etc.).",
            "Con_Sup_Pin_Box_Cd": "Código que indica si el componente tiene conexión superior tipo pin o box.",
            "Grado_Cd": "Código del grado del material del componente.",
            "Report_Journal_Id": "Identificador del reporte o journal asociado con el componente.",
            "Nro_Serie_Cd": "Número de serie del componente.",
            "Fecha_Par_Retirado_Dt": "Fecha en la que el componente fue parcialmente retirado.",
            "Nombre_Cd": "Código del nombre del componente.",
            "Wellbore_Id": "Identificador del wellbore asociado con el componente.",
            "Well_Id": "Identificador del pozo asociado con el componente.",
            "Diam_Nominal_Amt": "Diámetro nominal exterior del componente en pulgadas.",
            "Componente_Tipo_Cd": "Código que identifica el tipo de componente.",
            "Fecha_Fresado_Dt": "Fecha en que el componente fue fresado, si aplica.",
            "Fecha_Instalacion_Dt": "Fecha de instalación del componente en el pozo.",
            "Event_Id": "Identificador del evento relacionado con el componente. Es Foreign key.."
        }
    },
    "P_DIM_V.UPS_FT_DATOS_PERFILES": {
        "description_long": "Esta tabla contiene datos detallados sobre los pozos que fueron perfilados, incluyendo información sobre la operación, tiempos de espera de compañías, cantidad de carreras, tiempos de operación, tipos de perfiles, resistividades, presiones obtenidas, y otros aspectos clave de la operación de perfilaje. Es fundamental para consultas que requieren un seguimiento detallado del proceso de perfilaje en los pozos.",
        "description_short": "Tabla que almacena datos de pozos perfilados, incluyendo detalles operativos como tiempos de espera, tipos de perfiles, y resultados de las operaciones de perfilaje.",
        "columns": {
            "WELL_ID": "ID del pozo. Es un número en formato string que identifica de manera única al pozo y se utiliza para conectar con otras tablas.",
            "WELLBORE_ID": "ID del wellbore asociado al pozo.",
            "EVENT_ID": "ID del evento relacionado con la operación de perfilaje.. Es Foreign key.",
            "REPORT_JOURNAL_ID": "ID del reporte diario asociado a la operación de perfilaje.",
            "FECHA": "Fecha de la operación de perfilaje.",
            "CONTRATISTA": "Nombre de la compañía de servicio responsable de la operación de perfilaje.",
            "COMENTARIOS": "Comentarios adicionales sobre la operación de perfilaje.",
            "CORES_LOST": "Cantidad de núcleos o testigos perdidos durante la operación.",
            "CORES_NOT_RECOVERED": "Cantidad de núcleos o testigos que no fueron recuperados.",
            "CORES_RECOVERED": "Cantidad de núcleos o testigos recuperados.",
            "CURRENT_LOG_LINER_TOP": "Profundidad del tope del liner en el perfil actual.",
            "CURRENT_LOG_FILL": "Nivel de llenado en el perfil actual.",
            "CURRENT_LOG_PLUGBACK": "Profundidad de plugback en el perfil actual.",
            "CURRENT_LOG_TUBING": "Profundidad de la tubería en el perfil actual.",
            "CURRENT_LOG_TOTAL": "Total del perfil actual.",
            "FECHA_FIN": "Fecha de finalización de la operación de perfilaje.",
            "FECHA_INICIO": "Fecha de inicio de la operación de perfilaje.",
            "SUPERVISOR": "Supervisor o ingeniero a cargo de la compañía de perfilaje.",
            "RESISTIVIDAD_REVOQUE": "Resistividad medida del revoque.",
            "RESISTIVIDAD_FILTRADO": "Resistividad medida del filtrado.",
            "PERFILAJE": "Descripción del perfilaje realizado.",
            "NOTA": "Nota adicional que proporciona detalles importantes sobre la operación.",
            "FALLAS_COMPUTACIONALES": "Indicación de si hubo fallas computacionales durante la operación.",
            "DEMORAS_CONTRATISTA": "Demoras atribuibles a la compañía contratista.",
            "ESPERAS_HERRAMINETAS": "Demoras debido a la espera de herramientas de perfilaje.",
            "RESISTIVIDAD_LODO": "Resistividad medida en el lodo de muestra.",
            "PRESSURE_ATTEMPTS": "Número de intentos para obtener presiones.",
            "PRESSURES_OBTAINED": "Número de presiones obtenidas.",
            "OBJETIVO": "Objetivo de la operación de perfilaje.",
            "FECHA_PERFILAJE": "Fecha específica del perfilaje.",
            "NUMERO_REPORTE": "Número del reporte asociado al perfilaje.",
            "MUESTRAS": "Número de muestras obtenidas durante la operación.",
            "SIDEWALL_CORES": "Cantidad de núcleos obtenidos en las paredes laterales.",
            "TIME_BIT_OUT": "Tiempo total fuera de la broca.",
            "TIME_CIRCULATION_COMPLETE": "Tiempo total de circulación completa.",
            "TOTAL_LOGGED": "Total registrado durante la operación.",
            "TOTAL_HRS_OPERACION": "Horas totales de la operación.",
            "TEMPERATURA_FONDO": "Temperatura registrada en el fondo del pozo.",
            "COMENTARIO_INTERV": "Comentarios sobre intervenciones adicionales.",
            "MD_TOP": "Profundidad medida en el tope superior.",
            "INTERVALO": "Intervalo de operación.",
            "MD_BASE": "Profundidad medida en la base.",
            "TIEMPO_PERDIDO": "Tiempo perdido durante la operación.",
            "FINAL_DESMONTAJE": "Fecha y hora de finalización del desmontaje.",
            "MARCA_CERO": "Marca cero utilizada como referencia en la operación.",
            "REGISTRO_FONDO": "Registro del fondo del pozo.",
            "NUM_CARRERAS": "Número de carreras realizadas durante la operación.",
            "TIPO_PERFIL": "Tipo de perfil realizado.",
            "RETIRA_SONDA": "Fecha y hora en la que se retiró la sonda.",
            "TIEMPO_TOTAL": "Tiempo total de la operación.",
            "LOG_DATE": "Fecha del registro del perfil.",
            "CODIGO": "Código asociado al perfilaje.",
            "NOMBRE_MEDIDA": "Nombre de la medida realizada.",
            "TIPO_MEDIDA": "Tipo de medida realizada durante la operación.",
            "CLASE": "Clase del perfil realizado.",
            "DESCRIPCION": "Descripción adicional sobre el perfil.",
            "COMPANIA": "Compañía responsable de la operación.",
            "FECHA_INICIO_HERRAMIENTA": "Fecha de inicio de la herramienta utilizada.",
            "SELECTOR_TIPO_LOCACION": "Tipo de localización seleccionada para la operación.",
            "DESC_TIPO_LOCACION": "Descripción del tipo de localización.",
            "TOPE_SERVICIO": "Profundidad del tope de servicio.",
            "BASE_SERVICIO": "Profundidad de la base de servicio.",
            "REMARKS": "Comentarios adicionales o notas importantes.",
            "NO_ORIGEN_RADIOACTIVO": "Número de origen radioactivo.",
            "DESC_ORIGEN_RADIOATIVO": "Descripción del origen radioactivo.",
            "NUMERO_HERRAMIENTA": "Número de la herramienta utilizada en la operación."
        }
    },
    "P_DIM_V.UPS_FT_DLY_BHA_BITS_OP": {
        "description_long": "Tabla de datos de operaciones de BHA como por ejemplo numero de bha utilizados, fabricante y modelo de trepano, diámetro del trepano, fecha de entrada y salida del pozo, desde que y hasta que profundidad se utilizo",
        "description_short": "Tabla de datos de operaciones de BHA como por ejemplo numero de bha utilizados, fabricante y modelo de trepano, diámetro del trepano, fecha de entrada y salida del pozo, desde que y hasta que profundidad se utilizo",
        "columns": {
            "WELL_ID": "id de pozo. Suele ser un número en string de tipo 'yq2d3dh'. NO es el nombre del pozo sino su identificación. Sirve para conectar con otras tablas a partir del nombre de pozo. Es Foreign key",
            "EVENT_ID": "ID del evento relacionado. Es Foreign key. ",
            "WELLBORE_ID": "Id del Wellbore",
            "NUMERO": "Número correlativo del trépano. Numero correlativo de BHA,  por mas que se saque y vuelva a bajar el mismo le corresponde un numero desitinto e incremental en 1  ",
            "CARRERA": "Crece con c/trép. que ingresa o reingresa cada vez que se utiliza el mismo trepano.",
            "FABRICANTE": "Nombre del fabricante del componente. Quien fabrica el trepano o herramienta en la punta",
            "MODELO": "Modelo del equipo/ensamble instalado. Modelo que describe el trepano",
            "DIAMETRO": "Diámetro exterior del componente. Este diametro es del tamaño que quedara la seccion del pozo que perforen con el.",
            "ACTIVIDAD": "Actividad durante el período de control. Ejemplos DR =drilling, CA= calibrar",
            "FECHA_ENTRADA": "Fecha de ingreso del BHA al pozo. Cuando se arma y comienza a bajar al pozo",
            "FECHA_SALIDA": "Fecha en la que el BHA sale del pozo.  Fecha y horario en el que se termina de sacar el trepano del pozo",
            "PROF_CTRL": "MD Desde. Profundidad de control, en la que se encuentra al momento de cerrar el reporte de la medianoche",
            "MD_DESDE": "Profundidad del pozo al entrar el BHA",
            "MD_HASTA": "Prof. del pozo al retirar el BHA",
            "RPM_MINIMO": "RPM promedio rotando. Rpm aplicadas en promedio durante ese dia",
            "RPM_MAXIMO": "RPM mín. aplicadas en este control. Rpm minimas aplicadas durante ese dia",
            "RPM_ACTUAL": "RPM en el fondo. Rpm en fondo, son las rpm aplicadas en superficie con el top drive o bastago mas las rpm aplicadas por alguna herramienta de fondo como por ejemplo el motor de fondo.",
            "RPM_PROMEDIO": "RPM Actual",
            "Daily_Id": "Id del daily. id de reporte del dia.",
            "PROPOSITO": "Objetivo que se persigue con este BHA",
            "COMPORTAMIENTO_ESTIMADO": "Comportamiento estimado del BHA",
            "COMPORTAMIENTO_REAL": "Comportamiento real del BHA",
            "HORAS_CONTROL": "Hora en que se efectúa el control",
            "PROGRESO": "Progreso del trépano desde el chequeo anterior. Cuantos metros se avanzo",
            "DURACION": "cuantas se perforo, esto tiene que coincidir con lo que se cargo en el parte diario con codigo de operacion 2 que es perforar ",
            "HORAS_CIRCULACION": "Hrs. Circulación.",
            "BHA_RUN_ID": "Id del BHA",
            "BIT_OP_ID": "Id de la operación de trépano",
            "ASSEMBLY_ID": "Id del Ensamble",
            "ASSEMBLY_COMP_ID": "Id del Componente del Ensamble"
        }
    },
    "P_DIM_V.UPS_FT_DLY_DIRECCIONAL": {
        "description_long": "Tabla de datos de la carrera direccional como profundidad, inclinación, tool fase, BUR, TURN, compañía que opera",
        "description_short": "Tabla de datos de la carrera direccional como profundidad, inclinación, tool fase, BUR, TURN, compañía que opera",
        "columns": {
            "WELL_ID": "id de pozo. Suele ser un número en string de tipo 'yq2d3dh'. NO es el nombre del pozo sino su identificación. Sirve para conectar con otras tablas a partir del nombre de pozo. Es Foreign key",
            "EVENT_ID": "Id del Evento",
            "WELLBORE_ID": "Id del Wellbore",
            "SURVEY_HEADER_ID": "Id de la cabecera del Survey",
            "SURVEY_ID": "Id. id del survey o estacion.",
            "INICIO": "Fecha Inicio",
            "TIPO_HERRAMIENTA": "Nombre Direccional/Survey",
            "CIA_CONTROL_DIRECCIONAL": "Compañía de Control direccional",
            "MD_HEADER": "Prof. desarrollada hasta el punto de medición",
            "MD_MAX": "Profundidad máxima de la hta de medicón.  profundidad medida maxima alcanzada",
            "BLOQUEO": "Survey Bloqueado",
            "FECHA_STATION": "Fecha. fecha de la estacion, survey o registro son todos sinonimos",
            "TIPO": "Tipo",
            "MD": "Prof. desarrollada hasta el punto de medición",
            "INCLINACION": "Inclinación",
            "AZIMUTH": "Azimuth",
            "TVD": "TVD. true vertical depth o profundidad vertical medida desde el nivel cero en superficie a la proyeccion del punto de medida.",
            "OFFSET_ESTE_OESTE": "Distancia E/O del survey o calculada",
            "OFFSET_NORTE_SUR": "Distancia N/S del survey o calculada",
            "VERTICAL_SECTION": "Azimuth\nDistancia E/O del survey o calculada\nDistancia N/S del survey o calculada. Seccion vertical",
            "DOGLEG_SEVERITY": "DLS. severidad de el cambio de inclinacion medida en grados cada 30 mts.",
            "TFACE": "Tool Face Angle",
            "BUR": "BUR. build up rate o taza de construccion en altura.",
            "TURN": "zimuth Turn Rate. taza de construccion de giro.",
            "DESCRIPCION": "Hta. Descripción",
            "FECHA_FIN": "Fecha Fin"
        }
    },
    "P_DIM_V.UPS_FT_DLY_LODOS": {
        "description_long": "Tabla de datos del reporte de lodo, densidades, sodio, potasio,lgs hgs, etc",
        "description_short": "Tabla de datos del reporte de lodo, densidades, sodio, potasio,lgs hgs, etc",
        "columns": {
            "WELL_ID": "id de pozo. Suele ser un número en string de tipo 'yq2d3dh'. NO es el nombre del pozo sino su identificación. Sirve para conectar con otras tablas a partir del nombre de pozo. Es Foreign key",
            "EVENT_ID": "Id del Evento",
            "WELLBORE_ID": "Id del Wellbore",
            "FLUID_ID": "Unique Mud Check Identifier",
            "REPORT_JOURNAL_ID": "Id del Reporte .",
            "FECHA": "Fecha y hora de creación del reporte",
            "OIC_HORA": "Hora a la que se determinó OIC",
            "ULTIMA_ACT": "Fecha y hora de la última actualización",
            "OBSERVACIONES": "Observaciones",
            "FILTRADO_API": "Filtrado según norma API",
            "HORA": "Hora en que se efectuó el control de lodo",
            "COMPANIA": "Compañía del Servicio de Lodo",
            "ARENA": "Porcentaje de arena en el lodo",
            "REVOQUE": "Espesor del revoque por filtardo",
            "LODO_DESCRIPCION": "Descripción del tipo de lodo utilizado",
            "GEL_10MIN": "Gelificación después de 10 minutos. lectura del gel de 10 minutos",
            "GEL_10SEG": "Gelificación después de 10 segundos. lectura de gel de 10 segundos",
            "GEL_30MIN": "Gelificación después de 30 minutos. lectura de gel de 30 minutos",
            "PORC_PETROLEO": "Porcentaje de petróleo en el lodo",
            "PORC_AGUA": "Porcentaje de agua en el lodo",
            "TEMP_AT_AP": "Temperatura del ensayo a Alta Temp./Alta Presión",
            "FILTR_AT_AP": "Filtrado con Alta Temp./Alta Presión",
            "INGENIERO_LODO": "Representante de la Cía. de Control de Lodo",
            "TIPO_LODO_BASE": "Type. baseo oil, base agua ",
            "DENS_HGS": "Densidad de sólidos de alta densidad. densidad solidos de alta densidad",
            "DENS_LGS": "Densidad de sólidos de baja densidad. densidad solidos de baja densidad",
            "LGS_CORR": "Dens. corregida de sólidos de baja dens. solidos de baja densidad corregidos",
            "POLIMEROS": "Concentración de polímeros en el lodo",
            "EDTA": "Ácido etilendiaminotetraacético",
            "HGS": "Porcentaje de sólidos de alta densidad",
            "LGS": "Porcentaje de sólidos de baja densidad",
            "SOL_CORR": "Porcentaje de sólidos corregido (sin cloruros)",
            "ASG_DE_SOL": "Densidad relativa promedio de los sólidos",
            "SOLID_PERF": "Concentración de sólidos totales de perf.",
            "POLIMERO": "Tipo de polímero (Sintético/Orgánico/etc.)",
            "CONC_POTASIO": "Concentración del ión Potasio en el lodo",
            "CONC_CALCIO": "Concentración de ión Calcio en el lodo",
            "CONC_CLORO": "Concentración de ión cloro en el lodo",
            "METHYL_END_POINT": "FILTRATE_METHYL_END_POINT",
            "PF": "Punto final de fenolftaleína en el filtrado",
            "PH": "pH del lodo (concentración del ión H)",
            "DUREZA_TOT": "Concentración de Dureza Total",
            "PM": "Alcalinidad del lodo a la fenolftaleína",
            "LUGAR": "Lugar de donde se obtiene la muestra p/ensayo",
            "TVD_TEST": "Prof. Vertical (PfV) del pozo a la hora del control",
            "LODO_TIPO": "Tipo de lodo utilizado",
            "TEMP_CTRL_REOLOGICO": "Temperatura del control reológico",
            "VISC_PLAST": "Viscosidad Plástica del lodo",
            "DENSIDAD": "Densidad del lodo",
            "ECD": "Densidad Equivalente de Circulación",
            "TEMP_ENTR": "Temperatura de entrada del lodo",
            "VISCOSIDAD": "Viscosidad embudo del lodo",
            "YIELD_POINT": "Punto de fluencia del lodo",
            "ESTAB_ELECT": "Estabilidad eléctrica del lodo",
            "K": "Factor de la Ley Exponencial del flujo",
            "MD_TEST": "Prof. desarrollada (PfD) del pozo a la hora del control",
            "OIC_PROF": "Profundidad de la que proviene OIC",
            "N": "Exponente de la Ley Exponencial del flujo",
            "O_W_OIL": "Componente petróleo en la relación O/W.  O/W = oil water",
            "O_W_AGUA": "Componente agua en la relación O/W",
            "OP_FASE": "Fase o etapa de la operación actual.",
            "POM": "Alcalinidad del lodo",
            "TEMP_SAL": "Temperatura del flujo de descarga",
            "TEMP_VISCOSIMETRO": "Temperatura del viscosímetro",
            "LECTURA_VISCOSIMETRO_RPM": "Lectura del Viscosímetro para cada RPM",
            "RPM_VISCOSIMETRO": "RPM del Viscosímetro",
            "TEMPERATURA_LEIDA": "Temperatura leída"
        }
    },
    "P_DIM_V.UPS_FT_DLY_NPT_FALLAS": {
        "description_long": "Esta tabla contiene información detallada sobre fallas no productivas (NPT) y sus características asociadas en los pozos. Incluye datos sobre las causas, costos, duraciones, ubicaciones y detalles relacionados con las fallas durante las operaciones diarias. Es fundamental para consultas que requieren un seguimiento del impacto de las fallas en la eficiencia operativa y para la planificación de medidas preventivas.",
        "description_short": "Tabla de fallas no productivas (NPT) con detalles sobre causas, costos, duraciones, y otros datos relevantes para la gestión operativa y la mitigación de riesgos en los pozos.",
        "columns": {
            "WELL_ID": "Identificador del pozo asociado con la falla.",
            "EVENT_ID": "Identificador del evento durante el cual ocurrió la falla.",
            "FAILURE_ID": "Identificador único de la falla registrada.",
            "WELLBORE_ID": "Identificador del wellbore relacionado con la falla.",
            "REPORT_JOURNAL_ID": "Identificador del reporte o journal donde se registró la falla.",
            "FALLA_COSTO_DIA": "Costo diario atribuido a la falla.",
            "FALLA_TOTAL_COSTO_BRUTO": "Costo bruto total acumulado por la falla.",
            "FALLA_DESDE": "Fecha y hora desde la cual se registra la falla.",
            "FALLA_HASTA": "Fecha y hora hasta la cual se extendió la falla.",
            "FALLA_TOTAL_HORAS": "Total de horas que duró la falla.",
            "FALLA_CERRADA": "Indicador de si la falla ha sido cerrada y resuelta.",
            "FALLA_PROF": "Profundidad a la cual ocurrió la falla.",
            "FALLA_OTRO_COSTO": "Otros costos adicionales asociados con la falla.",
            "FALLA_LOCACION": "Ubicación específica de la falla.",
            "EQUIPO_PROPIETARIO": "Propietario del equipo afectado por la falla.",
            "FALLA_TIPO_ID": "Identificador del tipo de falla según clasificación interna.",
            "COMPANIA": "Compañía responsable o afectada por la falla.",
            "FALLA_SISTEMA_DESC": "Descripción del sistema donde ocurrió la falla.",
            "FALLA_SUBSISTEMA_DESC": "Descripción del subsistema específico afectado por la falla.",
            "EQUIPO_COSTO": "Costo del equipo afectado por la falla.",
            "SERVICIO": "Tipo de servicio afectado o requerido debido a la falla.",
            "NPT_CAUSA_RAIZ_ID": "Identificador de la causa raíz de la falla.",
            "NPT_UBICACION_ID": "Identificador de la ubicación específica del NPT.",
            "NPT_CONSECUENCIA_ID": "Identificador de las consecuencias del NPT.",
            "NPT_COSTO_CONTRATISTA": "Costos incurridos por contratistas debido al NPT.",
            "NPT_PRODUCTIVO": "Indica si el período de NPT fue utilizado de manera productiva.",
            "NPT_COSTO_NET_TOTAL": "Costo neto total asociado con el NPT.",
            "NPT_GRUPO_ID": "Identificador del grupo asociado al NPT.",
            "NPT_CAUSA_ID": "Identificador de la causa específica del NPT.",
            "FIRST_ACTIVITY_DAILY_ID": "Identificador de la primera actividad del día asociada al inicio del NPT.",
            "LAST_ACTIVITY_DAILY_ID": "Identificador de la última actividad del día asociada al final del NPT.",
            "LAST_ACTIVITY_ID": "Identificador de la última actividad relacionada con el NPT.",
            "TIPO_INSPECCION": "Tipo de inspección realizada en relación con el NPT.",
            "NPT_ANIDADO": "Indica si el NPT está anidado dentro de otros eventos.",
            "ES_READONLY": "Indica si el registro del NPT es de solo lectura.",
            "FALLA_TITULO": "Título descriptivo de la falla.",
            "FALLA_DESC": "Descripción detallada de la falla.",
            "COD_TIPO_NPT": "Código que identifica el tipo de NPT.",
            "TIPO_EVENTO_NO_PLANIFICADO": "Tipo de evento no planificado asociado con el NPT.",
            "NPT_UBICACION_DESC": "Descripción de la ubicación específica del NPT.",
            "NPT_RESPONSE_MATRIX": "Matriz de respuesta asociada al NPT.",
            "EQUIPO_ID": "Identificador del equipo utilizado. El usuario no conoce este valor, para utilizarlo deberás buscar el nombre del Equipo en otra tabla y hacer join con esta columna. Foreign Key.",
            "NPT_OPER_TYPE_DESC": "Descripción del tipo de operación durante el NPT.",
            "ESTADO": "Estado actual del registro de NPT.",
            "NOMBRE_INGENIERO": "Nombre del ingeniero a cargo durante el NPT.",
            "FECHA_VALIDACION": "Fecha en la que el NPT fue validado.",
            "NRO_CONTRATO_SAP": "Número de contrato SAP asociado con el NPT.",
            "CAUSA_RAIZ": "Descripción de la causa raíz de la falla.",
            "ACCIONES_PREVENTIVAS": "Acciones preventivas tomadas para evitar futuros NPT.",
            "PUNTOS_DE_APRENDIZAJE": "Lecciones aprendidas de la experiencia del NPT.",
            "FIRST_ACTIVITY_ID": "Identificador de la primera actividad relacionada con el NPT."
        }
    },
    "P_DIM_V.UPS_FT_DLY_TREPANOS": {
        "description_long": "Tabla de fabricante del trépano, modelo, diámetro, actividad, fecha de entrada, propósito, número de serie.",
        "description_short": "Tabla de fabricante del trépano, modelo, diámetro, actividad, fecha de entrada, propósito, número de serie.",
        "columns": {
            "REPORT_JOURNAL_ID": "Id del Reporte.",
            "CARRERA": "Crece con cada trépano que ingresa o reingresa. Crece cada vez que reingresa un trépano.",
            "FABRICANTE": "Nombre del fabricante del componente.",
            "MODELO": "Modelo del equipo/ensamble instalado. Modelo del trépano.",
            "ACTIVIDAD": "Actividad durante el período de control. Actividad de la carrera que se está realizando. Si el trépano se baja en la primera carrera para perforar, se saca y se vuelve a bajar para calibrar, es la segunda carrera con el objetivo CL = calibrar.",
            "FECHA_ENTRADA": "Fecha de ingreso del BHA al pozo del trépano.",
            "FECHA_SALIDA": "Fecha en la que el BHA sale del pozo el trépano.",
            "MD_DESDE": "Profundidad del pozo al entrar el BHA. Elevación del nivel de referencia. MD a la que se encuentra el pozo al comienzo del día.",
            "MD_HASTA": "Profundidad del pozo al retirar el BHA. Elevación del nivel de referencia. MD hasta en la que llega el pozo al cierre del día.",
            "RPM_MINIMO": "RPM promedio rotando. RPM mínimas del día.",
            "RPM_MAXIMO": "RPM mínimas aplicadas en este control. RPM máximas del día.",
            "RPM_PROMEDIO": "RPM promedio.",
            "PROPOSITO": "Objetivo que se persigue con este BHA. Trépano, no BHA.",
            "PREDICCION_DE_PERFORMANCE": "Comportamiento estimado del BHA. Comportamiento esperado del trépano.",
            "PERFORMANCE_ACTUAL": "Comportamiento real del BHA. Comportamiento obtenido del trépano.",
            "FECHA_OPERACION": "Hora en que se efectúa el control.",
            "PROGRESO_OPERACION": "Progreso del trépano desde el chequeo anterior. Cuantos metros se avanzó.",
            "TIEMPO_CIRCULACION": "Hrs. Circulación.",
            "DURACION_OPERACION": "Tiempo acumulado de la operación.",
            "SUPERVISOR_NAME_7": "Nombre del Supervisor.",
            "WELL_LEGAL_NAME": "Nombre legal del pozo (corresponde a la sigla).",
            "ASSEMBLY_NO": "Número de Ensamble.",
            "HOLE_SIZE": "Diámetro del pozo.",
            "COMP_GROUP": "Grupo de componente.",
            "COMP_NAME": "Nombre del Componente.",
            "MANUFACTURER": "Nombre del fabricante del componente.",
            "SERIAL_NO": "Número de serie del componente instalado.",
            "TREP_DIAMETRO": "Diámetro exterior del componente.",
            "Daily_Id": "Id del daily.",
            "TREP_DATE_OP": "Fecha de operación.",
            "Bit_Op_Id": "Id de la operación de trépano.",
            "TREP_ACTIVITY_CODE": "Código de Actividad del trépano.",
            "TREP_MD_OP_CTROL": "MD Desde. Elevación del Nivel de Referencia.",
            "TREP_MD_BASE": "Profundidad a la hora del control. Elevación del Nivel de Referencia.",
            "TREP_MD_TOP": "Profundidad superior del trépano.",
            "TREP_HORAS": "Horas de operación del trépano.",
            "TREP_PROGRESO": "Progreso del trépano desde el chequeo anterior.",
            "ROP": "Rate of penetration, tasa de perforación, velocidad de perforación. Todo medido en metros por hora.",
            "FASE": "Fase o etapa de la operación actual.",
            "DAILY_PROF_DESDE": "Profundidad desde para la Operación actual.",
            "DAILY_PROF_HASTA": "Profundidad hasta para la Operación actual.",
            "ASSEMBLY_NAME": "Nombre del Ensamble.",
            "PROF_CTRL": "Profundidad de control.",
            "NUMERO": "Número correlativo del trépano.",
            "ASSEMBLY_ID": "Id del Ensamble.",
            "EVENT_ID": "Id del Evento.",
            "WELL_ID": "Id de pozo. Suele ser un número en string de tipo 'yq2d3dh'. NO es el nombre del pozo sino su identificación. Es Foreign key.",
            "MODEL": "Modelo del equipo/ensamble instalado.",
            "RPM_ACTUAL": "RPM actual a la hora de cargar el reporte.",
            "DIAMETRO": "Diámetro exterior del componente.",
            "FECHA": "Fecha del Parte Diario.",
            "ASSEMBLY_COMP_ID": "Id del Componente del Ensamble.",
            "WELLBORE_ID": "Id del Wellbore."
        }
    },
    "P_DIM_V.UPS_FT_DLY_BIT_OP": {
        "description_long": "Tabla de datos de equipos en operacion de Trepano. Bombeo",
        "description_short": "Tabla de datos de equipos en operacion de Trepano. Bombeo",
        "columns": {
            "WELL_ID": "id de pozo. Suele ser un número en string de tipo 'yq2d3dh'. NO es el nombre del pozo sino su identificación. Sirve para conectar con otras tablas a partir del nombre de pozo. Es Foreign key",
            "EVENT_ID": "Caudal de bombeo",
            "DAILY_ID": "Id del daily",
            "BIT_OP_ID": "Id de la operación de trépano",
            "WELLBORE_ID": "Id del Wellbore",
            "ASSEMBLY_ID": "Id del Ensamble",
            "ASSEMBLY_COMP_ID": "Id del componente del ensamble",
            "WELLBORE_FORMATION_ID": "Id de la formación",
            "BHA_RUN_ID": "Id de la BHA",
            "ACTIVITY_CODE": "Actividad durante el período de control",
            "DATE_OP": "Hora en que se efectúa el control",
            "DENSITY": "Densidad del lodo durante el control",
            "AZIMUTH": "Azimuth",
            "FLOWRATE": "id del evento. taza de bombeo o galonaje o caudal en galones por minuto.",
            "HYDRAULIC_HP": "pot. hidrául. p/unidad de área del trép. potencia hidráulica dada por la cantidad de boquillas y en diámetro de las mismas.",
            "KILO_REV": "md hasta",
            "NOZZLE_VELOCITY": "cantidad de horas del trépano en uso desde el chequeo anterior. velocidad de salida del lodo por las boquillas.",
            "FORMATION_NAME": "formación",
            "OP_DURATION": "progreso del trépano desde el chequeo anterior. cuánto lleva acumulado desde que entró el trépano.",
            "OP_PROGRESS": "pérdida de carga a través del trépano. metros acumulados o que se avanzaron",
            "INCLINATION": "miles de revoluciones. inclinación",
            "PRESSURE_DROP_BIT": "presión fondo",
            "PRESSURE_STANDPIPE": "veloc. de penetrac. parcial y acumulada. presión de stand pipe es la presión de superficie.",
            "RPM_AVG": "rpm actual. rpm promedio",
            "RPM_CURRENT": "rpm en el fondo. rpm actual.",
            "RPM_DOWN_HOLE": "rpm máx. aplicadas en este control. rpm en fondo es rpm de superficie más las del motor de fondo. si no hay motor de fondo (mdf) a las rpm de superficie se le suma cero.",
            "RPM_MAX": "rpm mín. aplicadas en este control. rpm máximas en superficie.",
            "RPM_MIN": "rpm promedio rotando. rpm mínimas en superficie.",
            "MD_OP": "md desde",
            "ROP": "Revoluciones por volumen. velocidad de perforación o rate of penetration.",
            "WOB_AVG": "Peso s/Trépano Prom.",
            "TORQUE_AVG": "Torque Prom. en superficie",
            "WOB_CURRENT": "Peso s/Trépano Actual",
            "TORQUE_CURRENT": "Torque Actual",
            "TORQUE_MAX": "Torque Máx.",
            "WOB_MAX": "Carga máx. sobre el trépano en este control",
            "WOB_MIN": "Carga mín. sobre el trépano en este control",
            "TORQUE_MIN": "Torque Mín",
            "PRESSURE_OFF_BOTTOM": "Presión de bomba durante el control. Presion fuera de fondo, es decir la precion estabilizada cuando se circula el pozo sin tener el trepano apoyado en el fondo.",
            "CIRCULATING_TIME": "Hrs. Circulación.",
            "CONNECTION_TIME": "Hrs. Conexión",
            "MD_BASE": "Profundidad a la hora del control",
            "MD_TOP": "Velocidad de jet en las boquillas",
            "RPG": "RPM Prom.  REVOLUCIONES POR GALON.",
            "RPM_ROTATING_MIN": "RPM mín. rotando  (revoluciones por minuto)",
            "RPM_ROTATING_MAX": "RPM max. Rotando  (revoluciones por minuto)",
            "RPM_ROTATING_AVG": "RPM Promedio (revoluciones por minuto)",
            "RPM_ROTATING_CURRENT": "RPM Actual  (revoluciones por minuto)"
        }
    },
    "P_DIM_V.UPS_FT_SEGURIDAD": {
        "description_long": "Esta tabla contiene datos detallados (como las NOVEDADES) sobre la actividad operativa de los POZOS y EQUIPOS, y sus aspectos de seguridad, incluyendo información sobre las barreras de seguridad, la causa del incidente, el denunciante, la descripción del incidente, la ubicación del incidente, y otros detalles relevantes. Es fundamental para consultas que requieran un seguimiento exhaustivo de los incidentes de seguridad en operaciones de POZOS y EQUIPOS, así como para análisis de cumplimiento y auditorías de seguridad. Dado que no tiene la columna fecha, cuando se quiera filtrar por eventos de una fecha se deberá hacer join con EVENT_ID de P_DIM_V.UPS_FT_DLY_OPERACIONES, o en caso de que sea un evento actual (del día de hoy) se hará join con Event_Id de P_DIM_V.UPS_DIM_EQUIPOS_ACTIVOS para poder utiliza FECHA. \nPor ejemplo: quiero las novedades de seguridad del pozo X ordenadas por fecha. \n SQL query: SELECT FECHA, NOVEDADES FROM P_DIM_V.UPS_FT_SEGURIDAD JOIN P_DIM_V.UPS_DIM_BOCA_POZO ON P_DIM_V.UPS_FT_SEGURIDAD.WELL_ID = P_DIM_V.UPS_DIM_BOCA_POZO.Well_Id JOIN P_DIM_V.UPS_FT_DLY_OPERACIONES ON P_DIM_V.UPS_FT_SEGURIDAD.EVENT_ID = P_DIM_V.UPS_FT_DLY_OPERACIONES.EVENT_ID WHERE LOWER(P_DIM_V.UPS_DIM_BOCA_POZO.Boca_Pozo_Nombre_Oficial) LIKE LOWER('%X%') AND NOVEDADES IS NOT NULL ORDER BY P_DIM_V.UPS_FT_DLY_OPERACIONES.FECHA DESC;",
        "description_short": "Tabla que almacena datos de incidentes de seguridad en POZOS y EQUIPOS, con detalles sobre las barreras de seguridad, causas, responsables, y estado de los incidentes. Dado que no tiene la columna fecha, cuando se quiera filtrar por eventos de una fecha se deberá hacer join con EVENT_ID de P_DIM_V.UPS_FT_DLY_OPERACIONES, o en caso de que sea un evento actual (del día de hoy) se hará join con Event_Id de P_DIM_V.UPS_DIM_EQUIPOS_ACTIVOS para poder utiliza FECHA. Por ejemplo: quiero las novedades de seguridad del pozo X ordenadas por fecha. \n SQL query: SELECT FECHA, NOVEDADES FROM P_DIM_V.UPS_FT_SEGURIDAD JOIN P_DIM_V.UPS_DIM_BOCA_POZO ON P_DIM_V.UPS_FT_SEGURIDAD.WELL_ID = P_DIM_V.UPS_DIM_BOCA_POZO.Well_Id JOIN P_DIM_V.UPS_FT_DLY_OPERACIONES ON P_DIM_V.UPS_FT_SEGURIDAD.EVENT_ID = P_DIM_V.UPS_FT_DLY_OPERACIONES.EVENT_ID WHERE LOWER(P_DIM_V.UPS_DIM_BOCA_POZO.Boca_Pozo_Nombre_Oficial) LIKE LOWER('%X%') AND NOVEDADES IS NOT NULL ORDER BY P_DIM_V.UPS_FT_DLY_OPERACIONES.FECHA DESC;",
        "columns": {
            "WELL_ID": "Id de pozo. Suele ser un número en string de tipo 'yq2d3dh'. NO es el nombre del pozo sino su identificación. Sirve para conectar con otras tablas a partir del nombre de pozo. Lo utilizaras siempre para hacer join con otras tablas. Es Foreign key.",
            "EVENT_ID": "ID del evento relacionado con el incidente de seguridad. ES FUNDAMENTAL para poder hacer joins con EVENT_ID de P_DIM_V.UPS_FT_DLY_OPERACIONES para buscar por FECHA o rango de fechas. O bien para hacer joins con Event_Id de P_DIM_V.UPS_DIM_EQUIPOS_ACTIVOS (cuando se habla de eventos del día). Por ejemplo si se solicita algun evento de seguridad por para un rango de tiempo, deberas hacer join con P_DIM_V.UPS_FT_DLY_OPERACIONES para luego poder filtrar por FECHA. Es Foreign key",
            "DAILY_ID": "ID diario.",
            "REPORT_JOURNAL_ID": "ID del reporte diario.",
            "DOBLE_BARRERA": "Indicador de si existía doble parrera o presencia de BOP en el pozo.",
            "CAUSA": "Causa del incidente de seguridad.",
            "DENUNCIANTE": "Nombre de la persona o entidad que denunció el incidente.",
            "DESCRIPCION_INCIDENTE": "Descripción detallada del incidente de seguridad.",
            "LOCACION_INCIDENTE": "Ubicación geográfica, locación o yacimiento donde ocurrió el incidente.",
            "1ER_BARRERA": "Primera barrera de seguridad de contención del pozo, por lo general es FLUIDO.",
            "2DA_BARRERA": "Segunda barrera de seguridad de contención del pozo, por lo general es BOP.",
            "COMPANY_REPRESENTATIVE": "Company man que supervisó la operación.",
            "COMPANY_REPRESENTATIVE_2": "Segundo Company man que supervisó la operación.",
            "COMPANY_REPRESENTATIVE_3": "Tercer Company man que supervisó la operación.",
            "JEFE_EQUIPO": "Nombre del jefe de equipo que fue parte de la operación.",
            "MD_ACTUAL": "Medida de profundidad actual o medida del pozo.",
            "TVD_ACTUAL": "True Vertical Depth o profundidad vertical medida desde la superficie.",
            "ESTADO": "Estado actual de la operación o actividades desarrolladas.",
            "RESUMEN_24_HS": "Resumen de las actividades de las últimas 24 horas relacionadas con al contexto operativo.",
            "PROXIMAS_24_HS": "Planificación o predicciones para las próximas 24 horas relacionadas con el contexto operativo.",
            "NOVEDADES": "Cualquier novedad o actualización reciente relacionada con contexto operativo. Salvo que el usuario lo indique, siempre filtra por NOT NULL esta columna ya que tiene muchos valores NONE que no son de interes.",
            "COMPAÑÍA_RESPONSABLE": "Nombre de la compañía responsable del incidente de seguridad o actividad operativa.",
            "EQUIPO_ID": "Identificador del equipo utilizado. El usuario no conoce este valor, para utilizarlo deberás buscar el nombre del Equipo en otra tabla y hacer join con esta columna. Foreign Key.",
            "TIPO": "Tipo de equipo utilizado en la operación.",
            "TRIPTANK": "Detalles sobre el uso del trip tank."
        }
    },
    "P_DIM_V.UPS_FT_FORMACIONES_POZO": {
        "description_long": "Esta tabla contiene datos detallados sobre las formaciones geológicas encontradas en un pozo, incluyendo las profundidades medidas (MD) y verdaderas (TVD) desde y hasta, así como identificadores de litología y unidades estratigráficas. Es fundamental para consultas que requieren información sobre las características geológicas de los pozos y su estructura interna, proporcionando datos clave para la evaluación de recursos y la planificación de operaciones.",
        "description_short": "Tabla que almacena datos sobre las formaciones geológicas de un pozo, incluyendo profundidades y detalles sobre litología y unidades estratigráficas.",
        "columns": {
            "Well_Id": "ID de pozo. Suele ser un número en formato string que identifica de manera única al pozo y se utiliza para conectar con otras tablas.",
            "Wellbore_Id": "ID del wellbore asociado al pozo.",
            "Md_Tope_Num": "Profundidad medida (MD) del tope de la formación geológica.",
            "Tvd_Tope_Num": "Profundidad verdadera vertical (TVD) del tope de la formación geológica.",
            "Md_Base_Num": "Profundidad medida (MD) de la base de la formación geológica.",
            "Tvd_Base_Num": "Profundidad verdadera vertical (TVD) de la base de la formación geológica.",
            "Litologia_Id": "ID de la litología asociada a la formación geológica. Identifica el tipo de roca o sedimento.",
            "Unidad_Estratigrafica_Id": "ID de la unidad estratigráfica asociada a la formación. Se refiere a las capas de roca definidas geológicamente.",
            "Yacimiento_Id": "ID del yacimiento asociado a la formación geológica."
        }
    },
    "P_DIM_V.UPS_FT_DLY_ESTIM_TRATAMIENTO": {
        "description_long": "Esta tabla contiene datos detallados sobre los tratamientos de estimulación realizados en pozos, incluyendo información sobre presiones, caudales, tipo de tratamiento, aditivos, contratistas, y resultados obtenidos. Es fundamental para consultas que requieren un análisis profundo del rendimiento de los tratamientos de estimulación y su impacto en la productividad de los pozos.",
        "description_short": "Tabla que almacena datos sobre tratamientos de estimulación en pozos, incluyendo detalles operativos como presiones, caudales, y tipos de trabajos realizados.",
        "columns": {
            "Event_Id": "ID del evento relacionado con el tratamiento. Sirve para conectar esta tabla con otras tablas relacionadas con eventos. Es Foreign key",
            "Wellbore_Id": "ID del wellbore asociado al tratamiento.",
            "Report_Journal_Id": "ID del reporte diario asociado al tratamiento.",
            "Reporte_Nro": "Número del reporte relacionado con el tratamiento.",
            "Tipo_Pozo_Desc": "Descripción del tipo de pozo.",
            "Provincia": "Provincia donde se encuentra el pozo.",
            "Locacion_Name": "Nombre de la locación del pozo.",
            "Area_Reserva_Name": "Nombre del área de reserva.",
            "Fecha_Reporte_Evento_Dttm": "Fecha y hora en que se reportó el evento de tratamiento.",
            "Tipo_Aditivo_Ind": "Indicador del tipo de aditivo utilizado durante el tratamiento.",
            "Average_Fluid_Rate_Num": "Caudal promedio de fluido durante el tratamiento.",
            "Caudal_Inyeccion_Promedio_Num": "Caudal de inyección promedio durante el tratamiento.",
            "Contratista_Name": "Nombre de la compañía contratista que realizó el tratamiento.",
            "Trabajo_Especial_Ind": "Indicador de si el tratamiento fue un trabajo especial.",
            "Etapa_No_Realizada_Ind": "Indicador de si alguna etapa del tratamiento no fue realizada.",
            "Comentarios_Desc": "Comentarios adicionales sobre el tratamiento.",
            "Presion_Promedio_Num": "Presión promedio registrada durante el tratamiento.",
            "Presion_Ruptura_Num": "Presión de ruptura registrada durante el tratamiento.",
            "Profundidad_Tapon_Num": "Profundidad del tapón utilizado durante el tratamiento.",
            "Friccion_Punzados_Val": "Valor de la fricción de los punzados durante el tratamiento.",
            "Presion_Final_Val": "Presión final registrada al concluir el tratamiento.",
            "Eficiencia_Num": "Eficiencia del tratamiento, calculada en función de los resultados obtenidos.",
            "Gradiente_Fractura_Val": "Valor del gradiente de fractura registrado durante el tratamiento.",
            "Tortuosidad_Val": "Valor de la tortuosidad registrada durante el tratamiento.",
            "Presion_Inicial_Val": "Presión inicial registrada al comenzar el tratamiento.",
            "ISIP_PREFAC_Val": "Valor del ISIP (Instant Shut-In Pressure) prefractura.",
            "Base_Val": "Valor de la base del intervalo de tratamiento.",
            "Tope_Val": "Valor del tope del intervalo de tratamiento.",
            "Arenamiento_Ind": "Indicador de si ocurrió arenamiento durante el tratamiento.",
            "Trazador_Ind": "Indicador de si se utilizó trazador durante el tratamiento.",
            "Tipo_Trabajo_Desc": "Descripción del tipo de trabajo realizado durante el tratamiento.",
            "Presion_Maxima_Val": "Presión máxima registrada durante el tratamiento.",
            "Maxima_Concentracion_Val": "Máxima concentración de aditivos o agentes registrados durante el tratamiento.",
            "Friccion_Total_Val": "Valor total de la fricción registrada durante el tratamiento.",
            "Total_Arena_Usada_Val": "Total de arena utilizada durante el tratamiento.",
            "Tipo_Estimulacion_Name": "Nombre del tipo de estimulación realizada.",
            "Hora_Fin_Dttm": "Hora de finalización del tratamiento.",
            "Hora_Inicio_Dttm": "Hora de inicio del tratamiento.",
            "Descripcion_Herramienta_Name": "Descripción de la herramienta utilizada durante el tratamiento.",
            "Nro_Etapa_Plan_Val": "Número de la etapa planificada del tratamiento.",
            "Desplazamiento_Num": "Volumen de desplazamiento durante el tratamiento.",
            "Tratamiento_Val": "Valor total del tratamiento.",
            "Colchon_Val": "Volumen del colchón utilizado durante el tratamiento.",
            "Volumen_Reflujo_Val": "Volumen de reflujo registrado durante el tratamiento.",
            "Volumen_Reflujo_Total_Val": "Volumen total de reflujo registrado al finalizar el tratamiento.",
            "Diametro_Portacargas_Val": "Diámetro del portacargas utilizado durante el tratamiento.",
            "Tipo_Cargas_Name": "Nombre del tipo de cargas utilizadas.",
            "Desfazaje_Angular_Num": "Valor del desfazaje angular registrado durante el tratamiento.",
            "Peso_Cargas_Num": "Peso total de las cargas utilizadas durante el tratamiento.",
            "Diametro_Maximo_Num": "Diámetro máximo registrado durante el tratamiento.",
            "Numero_Intervalos_Num": "Número de intervalos tratados durante el tratamiento.",
            "Numero_Disparos_Num": "Número de disparos realizados durante el tratamiento.",
            "Caudal_Promedio_Num": "Caudal promedio registrado durante el tratamiento.",
            "Carrera_Fallida_Ind": "Indicador de si hubo una carrera fallida durante el tratamiento.",
            "Variaciones_No_Programadas_Num": "Número de variaciones no programadas registradas durante el tratamiento.",
            "Concentracion_Promedio_Val": "Concentración promedio de aditivos o agentes registrados durante el tratamiento.",
            "Responsable_Ypf_Name": "Nombre del responsable de YPF a cargo del tratamiento.",
            "Hhp_Consumidos_Val": "Valor de HHP (Caballos de fuerza hidráulicos) consumidos durante el tratamiento.",
            "Carta_Desc": "Descripción de la carta registrada durante el tratamiento.",
            "Bolsa_En_Fm_Num": "Número de bolsas utilizadas en la formación durante el tratamiento.",
            "Formacion_Pozo_Id": "ID de la formación geológica asociada al tratamiento.",
            "Nombre_Formacion_Name": "Nombre de la formación geológica tratada.",
            "Numero_Etapa_Plan_Cd": "Código del número de etapa planificada del tratamiento.",
            "Cant_Post_Frac_Ind": "Indicador de si hubo un post-fracturamiento durante el tratamiento.",
            "Formacion_Update_Dttm": "Fecha y hora de la última actualización de la formación tratada.",
            "Densidad_Promedio_Num": "Densidad promedio registrada durante el tratamiento.",
            "PFC_Val": "Valor de PFC registrado durante el tratamiento.",
            "Clase_Locacion_Desc": "Descripción de la clase de locación del pozo tratado.",
            "Stim_Treatment_Id": "ID único del tratamiento de estimulación.",
            "Boca_Pozo_Nombre_Corto_Oficial": "Nombre corto oficial de la boca del pozo tratado.",
            "Api_Nro": "Número de API asociado al pozo tratado.",
            "Uwi": "Identificación única del pozo tratada.",
            "Responsable_Contratista_Ypf_Name": "Nombre del responsable de la contratista en YPF durante el tratamiento.",
            "ISIP_POSTFRAC_Val": "Valor del ISIP (Instant Shut-In Pressure) post-fractura.",
            "Presion_Final_Casing_Num": "Presión final en el casing registrada al finalizar el tratamiento.",
            "Fecha_Reporte_Dt": "Fecha en que se reportó el tratamiento.",
            "Stim_Job_Id": "ID único del trabajo de estimulación.",
            "Well_Id": "ID del pozo tratado. Suele ser un número en formato string y es clave para conectar con otras tablas.",
            "Boca_Pozo_Nombre_Oficial": "Nombre oficial de la boca del pozo."
        }
    },
    "P_DIM_V.UPS_FT_ARQUITECTURA_GENERAL_POZO": {
        "description_long": "Esta tabla contiene datos detallados sobre la arquitectura general del pozo, incluyendo información sobre el ensamble, fases del pozo, contratistas, densidad del lodo, características del cabezal del pozo, y otros detalles importantes. Es crucial para consultas que requieren un análisis completo de la estructura y componentes instalados en un pozo a lo largo de sus diferentes fases operativas.",
        "description_short": "Tabla que almacena datos sobre la arquitectura general del pozo, incluyendo detalles sobre el ensamble, fases y contratistas involucrados.",
        "columns": {
            "Well_Legal_Name": "Nombre legal del pozo. Este nombre identifica de manera única al pozo en los registros oficiales.",
            "Event_Cd": "Código del evento relacionado con la arquitectura del pozo. Sirve para conectar con eventos específicos.",
            "Objetivo_Inicial_Txt": "Descripción del objetivo inicial del evento o fase operativa en el pozo.",
            "Fecha_Inicio_Evento_Dttm": "Fecha y hora de inicio del evento relacionado con la arquitectura del pozo.",
            "Ensamble_Name": "Nombre del ensamble instalado en el pozo durante la fase operativa.",
            "Tipo_Cd": "Código del tipo de ensamble o componente instalado en el pozo.",
            "Located_Inside_Name": "Nombre de la ubicación interna del ensamble o componente dentro del pozo.",
            "Instalacion_Dual_Ind": "Indicador de si la instalación del ensamble es dual.",
            "Casing_String_Ind": "Indicador de si la instalación incluye un casing string.",
            "Tipo_Conjunto_Cd": "Código del tipo de conjunto instalado en el pozo.",
            "Fase_Desc": "Descripción de la fase operativa actual del pozo.",
            "Top_At_Num": "Valor numérico que indica la profundidad en la que comienza el ensamble.",
            "Tvd_Assembly_Top_Num": "Profundidad verdadera vertical (TVD) en la que se encuentra la parte superior del ensamble.",
            "Tmd_Correction_Num": "Valor de corrección de la profundidad medida (TMD) del ensamble.",
            "Assembly_Length_Num": "Longitud total del ensamble instalado en el pozo.",
            "Md_Landed_Num": "Profundidad medida en la que se asentó el ensamble.",
            "Tvd_Toc_Num": "Profundidad verdadera vertical (TVD) del top of casing (TOC).",
            "Md_Program_Num": "Profundidad medida programada para el ensamble.",
            "Suspendido_De_Desc": "Descripción del estado suspendido del ensamble o componente.",
            "Fin_Bajada_Dttm": "Fecha y hora en que se completó la instalación del ensamble en el pozo.",
            "Contratista_Name": "Nombre del contratista encargado de la instalación del ensamble.",
            "Peso_En_Cunias_Num": "Peso aplicado en cunias durante la instalación.",
            "Circ_Previa_Num": "Valor numérico de la circulación previa al ensamble.",
            "Densidad_Lodo_Num": "Densidad del lodo utilizada durante la instalación del ensamble.",
            "Adminision_Ind": "Indicador de si hubo admisión durante la instalación del ensamble.",
            "Lodo_Perdido_Num": "Volumen de lodo perdido durante la instalación del ensamble.",
            "Modelo_Cabeza_Pozo_Desc": "Descripción del modelo de la cabeza del pozo.",
            "Modelo_Del_Colgador_Desc": "Descripción del modelo del colgador utilizado.",
            "Empaquetador_Desc": "Descripción del empaquetador instalado en el pozo.",
            "Diametro_Brida_Sup_Num": "Diámetro de la brida superior del pozo.",
            "Presion_Brida_Sup_Num": "Presión soportada por la brida superior del pozo.",
            "Diametro_Brida_Inf_Num": "Diámetro de la brida inferior del pozo.",
            "Presion_Brida_Inf_Num": "Presión soportada por la brida inferior del pozo.",
            "Comments_Txt": "Comentarios adicionales sobre la instalación o características del ensamble.",
            "Install_Dttm": "Fecha y hora de la instalación del ensamble.",
            "Pulled_Dttm": "Fecha y hora en que se retiró el ensamble del pozo.",
            "Last_Status_Dttm": "Fecha y hora del último estado registrado del ensamble.",
            "Create_User_Id": "ID del usuario que creó el registro del ensamble.",
            "Create_Dttm": "Fecha y hora de creación del registro del ensamble.",
            "Update_User_Id": "ID del usuario que actualizó por última vez el registro del ensamble.",
            "Update_Dttm": "Fecha y hora de la última actualización del registro del ensamble.",
            "Peso_Asentado_Num": "Peso total asentado del ensamble.",
            "Diametro_Nominal_Num": "Diámetro nominal del ensamble o componente.",
            "Wellbore_Num": "Número del wellbore asociado al ensamble.",
            "Assembly_Id": "ID del ensamble instalado en el pozo. Clave primaria que conecta con otras tablas relacionadas.",
            "Wellbore_Id": "ID del wellbore asociado al ensamble.",
            "Well_Id": "ID del pozo al que pertenece el ensamble. Es una clave primaria para la conexión con otras tablas. Es Foreign key",
            "Fabricante_Cabeza_Pozo_Txt": "Texto que indica el fabricante de la cabeza del pozo.",
            "De_Tope_A_Base_Ind": "Indicador de si el ensamble se extiende desde el tope a la base.",
            "Fecha_Fin_Evento_Dttm": "Fecha y hora de finalización del evento relacionado con la arquitectura del pozo.",
            "API_Nro": "Número API asociado al pozo.",
            "Yacimiento_Name": "Nombre del yacimiento donde se encuentra el pozo.",
            "Event_Id": "ID del evento relacionado con la instalación del ensamble. Es Foreign key."
        }
    },
    "P_DIM_V.UPS_FT_AVANCE_PERFORACION": {
        "description_long": "Esta tabla contiene datos detallados sobre el avance en la perforación de pozos, incluyendo información sobre el progreso diario, profundidades alcanzadas, y detalles del equipo utilizado. Es crucial para el seguimiento del progreso en tiempo real de las operaciones de perforación, permitiendo monitorear el rendimiento y la eficiencia del proceso.",
        "description_short": "Tabla que almacena datos sobre el avance diario de perforación, incluyendo profundidades y progreso alcanzado.",
        "columns": {
            "Fecha_Dttm": "Fecha y hora en que se registró el avance de perforación. Es clave para seguir el progreso diario de las operaciones.",
            "Progreso_Num": "Número que representa el progreso diario en la perforación. Indica la cantidad de metros avanzados en el pozo.",
            "Equipo_Id": "Identificador del equipo utilizado. El usuario no conoce este valor, para utilizarlo deberás buscar el nombre del Equipo en otra tabla y hacer join con esta columna. Foreign Key.",
            "Report_Journal_Id": "ID del reporte diario relacionado con el avance de perforación. Permite la trazabilidad del progreso.",
            "Md_Actual_Num": "Profundidad medida (MD) actual alcanzada durante la perforación. Indica la profundidad total del pozo en metros.",
            "Daily_Id": "ID diario del reporte de perforación. Sirve para identificar el día específico de la operación.",
            "Wellbore_Id": "ID del wellbore asociado a la operación de perforación. Es una clave externa para conectar con tablas relacionadas.",
            "Well_Id": "ID del pozo en el que se realiza la perforación. Es una clave primaria para la conexión con otras tablas.",
            "Is_Final_Report_Ind": "Indicador que señala si el reporte es el final de la operación de perforación. Un valor booleano que distingue entre reportes finales y preliminares.",
            "Tvd_Actual_Num": "Profundidad verdadera vertical (TVD) actual alcanzada durante la perforación. Indica la profundidad desde la superficie hasta el punto más bajo en línea recta.",
            "Evento_Cd": "Código del evento asociado a la perforación. Puede referirse a diferentes etapas o incidentes durante la operación.",
            "Event_Id": "ID del evento relacionado con la perforación. Es una clave externa que permite la conexión con otras tablas de eventos. Es Foreign key."
        }
    },
    "P_DIM_V.UPS_FT_INVENTARIO_MATERIALES_OPER_POZO": {
        "description_long": "Esta tabla contiene datos detallados sobre el inventario de materiales utilizados en las operaciones de pozo. Incluye información sobre la cantidad de materiales inicial, recibida, consumida, y devuelta durante el día, así como ajustes realizados en el inventario y sus causas. Es fundamental para el seguimiento y control de los recursos materiales utilizados en la operación del pozo. SIEMPRE que se seleccione esta tabla deberás tener en cuenta la columna unidad de medida \"UNIDAD_MEDIDA_DEL_ITEM\", ya que se deberá usar para cualquier cálculo para evitar sumar items de distintas unidades (litros y metros cubicos por ejemplo). SIEMPRE la utilizaras cuando se hable del consumo de algún item por ejemplo \"consumo de gas oil\" \"consumo de baritina\" entre otros. ",
        "description_short": "Tabla que almacena datos sobre el inventario de materiales en operaciones de pozo, incluyendo cantidades iniciales, consumidas, y ajustes. SIEMPRE que se seleccione esta tabla deberás tener en cuenta la columna unidad de medida \"UNIDAD_MEDIDA_DEL_ITEM\", ya que se deberá usar para cualquier cálculo para evitar sumar items de distintas unidades (litros y metros cubicos por ejemplo).",
        "columns": {
            "ITEM": "Nombre o descripción del ítem/material en el inventario.",
            "CANT_ITEM_INICIAL": "Cantidad inicial del ítem al comienzo del día.",
            "CANT_ITEM_RECIBIDA_EN_EL_DIA": "Cantidad de ítems recibidos durante el día.",
            "AJUSTE": "Ajustes realizados en la cantidad de ítems, por ejemplo, correcciones de inventario.",
            "CANT_ITEM_CONSUMIDA_EN_EL_DIA": "Cantidad de ítems consumidos durante el día en la operación del pozo.",
            "CANT_ITEM_AL_CIERRE": "Cantidad de ítems restantes al cierre del día.",
            "COMENTARIOS_CAUSA_AJUSTE": "Comentarios o explicación sobre las causas del ajuste en el inventario.",
            "POSICION": "Posición del ítem en el inventario o almacén.",
            "UNIDAD_MEDIDA_DEL_ITEM": "Unidad de medida del ítem, como kg, litros, unidades, metros cúbicos etc. SIEMPRE seleccione esta columna ya que se deberá usar en todos los cálculos para evitar sumar items de distintas unidades (litros y metros cubicos por ejemplo).",
            "Bulk_Tran_Id": "ID de la transacción de inventario a granel. Es una clave externa.",
            "Event_Id": "ID del evento relacionado con la operación del pozo. Es una clave externa.",
            "WELL_ID": "ID del pozo asociado a la operación. Sirve para conectar con otras tablas. Es una clave externa.",
            "CANT_ITEM_DEVUELTA_EN_EL_DIA": "Cantidad de ítems devueltos durante el día.",
            "FECHA": "Fecha en la que se registró el inventario.",
            "EQUIPO_ID": "Identificador del equipo utilizado. El usuario no conoce este valor, para utilizarlo deberás buscar el nombre del Equipo en otra tabla y hacer join con esta columna. Foreign Key.",
            "Bulk_Id": "ID de inventario a granel relacionado con la operación."
        }
    },
    "P_DIM_V.UPS_FT_DLY_COSTOS": {
        "description_long": "Tabla de datos que almacena los costos diarios asociados a las operaciones de perforación y mantenimiento de pozos. Incluye información detallada sobre los códigos de costos, descripciones, proveedores, contratos, y montos en diferentes monedas. Es utilizada para el control y seguimiento financiero de las actividades diarias en los pozos.",
        "description_short": "Tabla de costos diarios asociados a las operaciones de pozos.",
        "columns": {
            "AFE_ID": "ID de la Autorización para el Gasto (AFE). Sirve para conectar con otros registros financieros relacionados.",
            "CLASE_COSTO": "Clase o categoría del costo asociado a la operación.",
            "FASE_COD": "Código alfanumérico de la fase. A continuación, te daré los códigos de las fases más usuales:\n- 00: PREPARACIÓN DE LOCACIÓN\n- 01: DTM\n- 03: REVESTIMIENTO GUÍA\n- 04: REVESTIMIENTO DE SEGURIDAD\n- 05: REVESTIMIENTO INTERMEDIA 1\n- 06: REVESTIMIENTO INTERMEDIA 2\n- 07: REVESTIMIENTO INTERMEDIA 3\n- 08: REVESTIMIENTO DE AISLACIÓN\n- 0P: PLANTA LODO\n- 0S: STANDBY\n- 10a: CONTACTA/INTERVIENE FORMACIÓN\n- 10b: BAJAR INSTALACIÓN\n- 11a: SACAR INSTALACIÓN\n- 11b: ACONDICIONA/REPARA POZO\n- 12: TAPONAMIENTO Y ABANDONO",
            "COSTO_COD": "Código específico del costo, utilizado para su identificación en el sistema.",
            "DESCRIPCION": "Descripción detallada del costo.",
            "ACTIVIDAD_COD": "Código de la actividad específica relacionada con el costo.",
            "ACTIVIDAD_DESC": "Descripción de la actividad relacionada con el costo.",
            "PROVEEDOR": "Nombre del proveedor que suministró el bien o servicio asociado al costo.",
            "NRO_CONTRATO": "Número del contrato bajo el cual se realizó la operación de costo.",
            "POSICION": "Posición o línea en el contrato o presupuesto a la que corresponde el costo.",
            "POSICION_DESC": "Descripción de la posición o línea en el contrato.",
            "LINEA": "Línea de referencia para el costo dentro del sistema.",
            "SERVICIO_SAP": "Código del servicio según el sistema SAP.",
            "UNIDAD": "Unidad de medida asociada al costo, como horas, metros, etc.",
            "CANTIDAD": "Cantidad del bien o servicio suministrado.",
            "COSTO_UNITARIOUSD": "Costo unitario del bien o servicio en USD.",
            "MONTO_TOATALUSD": "Monto total del costo en USD.",
            "COSTO_TOTAL_ALT_ARG": "Costo total alternativo en moneda argentina (ARS).",
            "COSTO_ALT_UNIT_ARG": "Costo unitario alternativo en moneda argentina (ARS).",
            "MONEDA": "Moneda en la que se registró el costo.",
            "EVENTO_COD": "Código del evento asociado a la operación.",
            "AFE_TIPO": "Tipo   de Autorización para el Gasto (AFE) utilizada.",
            "DM_NRO": "Número de documento asociado al costo.",
            "FECHA_CREACION": "Fecha en la que se creó el registro de costo.",
            "FECHA_ACTUALIZACION": "Fecha de la última actualización del registro de costo.",
            "AFE_NO": "Número de Autorización para el Gasto (AFE).",
            "FECHA_COSTO": "Fecha en la que se incurrió el costo.",
            "DAILY_ID": "ID del registro diario asociado al costo.",
            "EVENT_ID": "ID del evento asociado al costo. Es Foreign key.",
            "WELL_ID": "ID del pozo relacionado con el costo. Es una clave externa.",
            "PTO_PROG": "Punto de programa relacionado con el costo.",
            "SERVICIO_DESC": "Descripción del servicio proporcionado.",
            "COST_SUBCOD": "Subcódigo específico del costo.",
            "WELLBORE_ID": "ID del wellbore asociado con el costo. Es una clave externa.",
            "DAILYCOST_ID": "ID único del registro de costo diario.",
            "REPORT_JOURNAL_ID": "ID del informe o journal relacionado con el costo."
        }
    },
    "P_DIM_V.UPS_FT_DATOS_PUNZADOS": {
        "description_long": "Esta tabla almacena información detallada sobre las operaciones de punzado en pozos, incluyendo datos sobre contratistas, presiones, densidades, fluidos, intervalos y otros parámetros técnicos críticos. Se utiliza para el análisis y control de las actividades de punzado, permitiendo un seguimiento preciso de cada operación y facilitando la toma de decisiones basada en datos de campo.",
        "description_short": "Tabla de datos de operaciones de punzado en pozos.",
        "columns": {
            "Contratista_Cd": "Código del contratista que realizó la operación de punzado.",
            "Balance_Presion_Desc": "Descripción del balance de presión utilizado durante la operación.",
            "Fecha_Presion_Final_Superficie_Dttm": "Fecha y hora en que se registró la presión final en la superficie.",
            "Densidad_Num": "Valor numérico de la densidad del fluido utilizado en la operación.",
            "Fluido_Pozo_Desc": "Descripción del tipo de fluido utilizado en el pozo.",
            "Inicia_Dttm": "Fecha y hora de inicio de la operación de punzado.",
            "Finaliza_Dttm": "Fecha y hora de finalización de la operación de punzado.",
            "Intervalos_Num": "Número total de intervalos en la operación.",
            "Espesor_Neto_Punzado_Num": "Espesor neto punzado en la operación.",
            "Punza_Con_Desc": "Descripción del método o equipo utilizado para el punzado.",
            "Md_Desde_Num": "Profundidad medida desde donde comenzó la operación.",
            "Nivel_Pozo_Num": "Nivel del pozo al momento de la operación.",
            "Tvd_Reservorio_Num": "Profundidad vertical verdadera del reservorio al momento de la operación.",
            "Tipo_Porta_Cargas_Desc": "Descripción del tipo de porta cargas utilizado.",
            "Fabricante_Porta_Cargas_Name": "Nombre del fabricante del porta cargas utilizado.",
            "Diametro_Porta_Cargas_Num": "Diámetro del porta cargas utilizado.",
            "Tipo_Cargas_Desc": "Descripción del tipo de cargas utilizado en la operación.",
            "Fabricante_Cargas_Name": "Nombre del fabricante de las cargas utilizadas.",
            "Pz_Sup_Pz_Inf_Num": "Distancia entre la superficie y el fondo del pozo.",
            "Defasaje_Angular_Num": "Valor del desfase angular medido durante la operación.",
            "Peso_Cargas_Num": "Peso de las cargas utilizadas en la operación.",
            "Fecha_Hora_Dttm": "Fecha y hora en la que se registró el evento de la operación.",
            "Diametro_Maximo_Num": "Diámetro máximo alcanzado durante la operación de punzado.",
            "Tipo_Punzado_Desc": "Descripción del tipo de punzado realizado.",
            "Densidad_Tiros_Num": "Densidad de tiros utilizada durante la operación.",
            "Md_Desde_Intervalo_Num": "Profundidad medida desde el intervalo de punzado.",
            "Parada_Ccl_Num": "Número de paradas de la herramienta o del sistema durante la operación.",
            "Motivo_Punzado_Desc": "Descripción del motivo por el cual se realizó la operación de punzado.",
            "Status_Cd": "Código del estado de la operación de punzado.",
            "Is_Misrun_Ind": "Indicador de si la operación fue un fallo o no.",
            "Comments_Desc": "Comentarios adicionales relacionados con la operación.",
            "Nro_Etapa_Plan_Desc": "Descripción del número de etapa planificada para la operación.",
            "Nro_Disparos_Num": "Número de disparos realizados durante la operación.",
            "Presion_Boca_Pozo_Num": "Presión registrada en la boca del pozo.",
            "Presion_Fondo_Num": "Presión registrada en el fondo del pozo.",
            "Presion_Diferencial_Num": "Diferencia de presión registrada entre diferentes puntos de la operación.",
            "Presion_Final_Bp_Num": "Presión final balanceada registrada.",
            "Presion_Est_Reservorio_Num": "Presión estimada del reservorio al momento de la operación.",
            "Disparos_Fallados_Num": "Número de disparos fallidos durante la operación.",
            "Dist_Ccl_Tiro_Num": "Distancia medida entre el collarín y el tiro.",
            "Metodo_Desc": "Descripción del método utilizado para la operación.",
            "Instalacion_Name": "Nombre de la instalación donde se llevó a cabo la operación.",
            "Report_Journal_Id": "ID del informe o journal relacionado con la operación.",
            "Wellbore_Id": "ID del wellbore asociado con la operación. Es una clave externa.",
            "Well_Id": "ID del pozo asociado con la operación. Es una clave externa.",
            "Md_Hasta_Intervalo_Num": "Profundidad medida hasta el intervalo de punzado.",
            "Md_Hasta_Num": "Profundidad medida hasta el final de la operación.",
            "Altura_Inicial_Fluido_Num": "Altura inicial del fluido en el pozo.",
            "Densidad_Promedio_Num": "Densidad promedio del fluido en el pozo.",
            "Fecha_Dttm": "Fecha y hora del registro en la tabla.",
            "Event_Id": "ID del evento asociado a la operación. Es Foreign key."
        }
    },
    "P_DIM_V.UPS_DIM_ZONA": {
        "description_long": "Esta tabla contiene información sobre las zonas o áreas de yacimientos petrolíferos/gasíferos en YPF. Proporciona una estructura organizativa que permite clasificar y agrupar los yacimientos según su ubicación geográfica o características operativas. La tabla es fundamental para realizar análisis regionales, comparar rendimientos entre diferentes zonas y gestionar operaciones por área geográfica. Cada registro en esta tabla representa un yacimiento específico con su correspondiente zona asignada. Esta información es especialmente útil cuando se necesita filtrar o agrupar datos de producción, intervenciones o análisis por zonas específicas. La relación entre yacimientos y zonas es de muchos a uno, donde varios yacimientos pueden pertenecer a una misma zona, pero cada yacimiento está asignado a una única zona específica.",
        "description_short": "Esta tabla contiene la relación entre yacimientos y sus zonas correspondientes, permitiendo la clasificación y agrupación de yacimientos según su ubicación geográfica u operativa.",
        "columns": {
            "YACIMIENTO_ID": "Identificador único del yacimiento. Es una clave primaria o foránea que se utiliza para relacionar esta tabla con otras que contengan información detallada sobre yacimientos. El usuario no suele conocer este valor directamente y generalmente debe hacer un join con otras tablas para utilizarlo.",
            "NOMBRE_YACIMIENTO": "Nombre completo del yacimiento. Este campo contiene el nombre oficial y completo por el cual se conoce al yacimiento dentro de YPF. Consejo: utiliza `LIKE` wildcard, '%' y '_' para búsquedas en esta columna cuando no estés seguro de la ortografía exacta.",
            "NOMBRE_CORTO_YACIMIENTO": "Versión abreviada o nombre corto del yacimiento. Útil para reportes o visualizaciones donde el espacio es limitado. En algunos casos puede contener acrónimos o abreviaciones estándar utilizadas internamente en YPF. Consejo: utiliza `LIKE` wildcard, '%' y '_' para búsquedas en esta columna.",
            "ZONA_YACIMIENTO": "Designación de la zona geográfica u operativa a la que pertenece el yacimiento. Este campo permite agrupar yacimientos que comparten características regionales o que pertenecen a una misma área operativa. Es frecuentemente utilizado como criterio de filtrado en análisis regionales o comparativos. Consejo: utiliza `LIKE` wildcard, '%' y '_' para búsquedas en esta columna."
        }
    },
    "P_DIM_V.UPS_DIM_CLASIF_OPERACION": {
        "description_long": "Es la tabla maestra de todas las combinaciones posibles de eventos, fases, actividades, operacion y suboperación. Proporciona los campos de descripción de cada código que se relacionan con otras tablas. Las columnas finalizadas en DESC hacen referencia a las descripciones de cada código y se debe utilizar `LIKE` wildcard, '%' y '_' para búsquedas en estas columnas.",
        "description_short": "Tabla maestra con codigo y descripción de eventos, fases, actividades, operacion y suboperación",
        "columns": {
            "EVENTO_COD": "Clave Principal que en otras tablas puede tener el nombre de EVENTO_COD o EVENT_CODE. Código alfanumérico que identifica el tipo de evento en el ámbito de oil & gas. Este código se utiliza para clasificar y consultar eventos específicos de manera concisa en el sistema. Los posibles eventos y sus respectivas siglas son los siguientes:\n- INW: Intervención Workover\n- REP: Reparación\n- PER: Perforación\n- STB: Stand by\n- INT: Intervención pulling\n- ABA: Abandono\n- PTL: Planta de lodos\n- ISW: Evento indefinido o en espera de especificar\n- TER: Terminación\n- RPE: re entry o reingreso\n- PRF: Pre factura\nEste código permite que los usuarios, cuando hacen consultas SQL a partir de texto, puedan referirse a eventos de manera directa, por ejemplo, 'equipos en pulling' quiere decir 'equipos en el evento de pulling EVENT_CODE INT'.",
            "FASE_COD": "Código alfanumérico de la fase. A continuación, te daré los códigos de las fases más usuales (La descripción de cada código está en el campo FASE_DESC):\n- 00: PREPARACIÓN DE LOCACIÓN\n- 01: DTM\n- 03: REVESTIMIENTO GUÍA\n- 04: REVESTIMIENTO DE SEGURIDAD\n- 05: REVESTIMIENTO INTERMEDIA 1\n- 06: REVESTIMIENTO INTERMEDIA 2\n- 07: REVESTIMIENTO INTERMEDIA 3\n- 08: REVESTIMIENTO DE AISLACIÓN\n- 0P: PLANTA LODO\n- 0S: STANDBY\n- 10a: CONTACTA/INTERVIENE FORMACIÓN\n- 10b: BAJAR INSTALACIÓN\n- 11a: SACAR INSTALACIÓN\n- 11b: ACONDICIONA/REPARA POZO\n- 12: TAPONAMIENTO Y ABANDONO",
            "FASE_DESC": "Descripción de la fase operativa actual del pozo. Utilizar `LIKE` wildcard, '%' y '_' para búsqueda en esta columna.",
            "ACTIVIDAD_COD": "Código que identifica la actividad específica.",
            "ACTIVIDAD_DESC": "Descripción de la actividad realizada. Utilizar `LIKE` wildcard, '%' y '_' para búsqueda en esta columna.",
            "OPERACION_COD": "Código que identifica la operación.",
            "OPERACION_DESC": "Descripción de la operación realizada. Utilizar `LIKE` wildcard, '%' y '_' para búsqueda en esta columna.",
            "SUBOPERACION_COD": "Código que identifica la suboperación dentro de la actividad.",
            "SUBOPERACION_DESC": "Descripción de la suboperación. Utilizar `LIKE` wildcard, '%' y '_' para búsqueda en esta columna."
        }
    }
}